#pragma once
#include "stdafx.h"
#include "GVariable.h"
#include "GEnum.h"

DWORD64				g_hModuleMain = 0;
DWORD64				g_hModuleDLL = 0;
int					g_nIndex = -1;
HWND				g_hGameWnd = 0;
LONG_PTR			g_dwOrgWndLong = 0;

BYTE				g_pbKeyState[0x100];

DWORD				g_dwClientPID = 0;

DWORD64				g_qwTickCount = 0;
DWORD64				g_qwInterval = INTERVALS;
DWORD64				g_qwAutoLogicTick = 0;
DWORD64				g_qwLastTickCount = 0;
DWORD64				g_qwWaitTime = 0;
DWORD				g_dwGameServerTime = 0;
DWORD64				g_qwGoldChangeTick = 0;

DWORD64				g_dwStartTickCount = 0;
DWORD64				g_qwNetworkTick = 0;
DWORD64				g_qwWarningTick = 0;
DWORD64				g_qwGameLoadingTick = 0;
DWORD64				g_qwMapLoadingTick = 0;
DWORD64				g_qwPartyDungeonTick = 0;

BOOL				g_bPartyDungeonOut = FALSE;

int					g_qwAddrMemCount = 0;
DWORD				g_qwAddrMemGWorld[100];
DWORD64				g_qwMemGWorldTick = 0;

DWORD				g_dwAddrLastTime = 0;
int					g_nServerLogTick = 0;

BYTE				g_bServerWait = 0;
DWORD64				g_dwServerSelTick = 0;
DWORD64				g_dwServerLoginTick = 0;

DWORD64				g_dwCharSelectTick = 0;
DWORD64				g_dwCharStartTick = 0;

GAME_MAPPING* g_pGameMapping = NULL;
GAME_INFO* g_pGameInfo = NULL;
int					g_pCharacterInfo[MAX_CHARACTER];

HANDLE				g_hWaitEvent = NULL;
HANDLE				g_hAnswerEvent = NULL;

int					g_nSceneOffset = 0;

int					g_nCrackStep = 30;

WCHAR				g_szAutoID[MAX_NAME] = { 0, };
WCHAR				g_szGameID[MAX_NAME] = { 0, };

int					g_nCreateLen = 0;
WCHAR				g_szCreateName[MAX_NAME];

int					g_nCurScene = Scene_None;
int					g_nPreScene = Scene_None;

int					g_nCurStatus = Status_None;
int					g_nPreStatus = Status_None;
int					g_nTarStatus = Status_None;

int					g_nStepStatus = 0;

BOOL				g_bAutoRun = TRUE;
int					g_nTestType = 0;
int					g_nCount = 0;
BOOL				g_bTestLog = FALSE;

int					g_nGameServer = 0;
int					g_nGameChar = 0;

CharInfo			g_pCharInfo;

ObjectInfo			g_pObjectInfo[MAX_OBJECT];
int					g_nObjectCount = 0;


int					g_nInvenMaxCount = 0;
int					g_nInvenCount = 0;
ItemInfo			g_pInvenInfo[MAX_INVEN];
int					g_nInvenWeight = 0;


ItemInfo			g_pWarehouseInfo[MAX_WAREHOUSE] = { 0, };
int					g_nWarehouseCount = 0;
int					g_nWarehouseMaxCount = 0;

SkillInfo			g_pSkillInfo[MAX_SKILL];
int					g_nSkillCount = 0;

SkillCycleInfo		g_pSkillCycleInfo[MAX_SKILLCYCLE] = { 0, };
int					g_nSkillCycleCount = 0;

QuickSlotInfo		g_pQuickSlotInfo[MAX_QUICKSLOT];

QuestInfo			g_pQuestInfo[MAX_QUEST];
int					g_nQuestCount = 0;

ItemCollectionInfo	g_pItemCollectionInfo[MAX_ITEMCOLLECTION];
int					g_nItemCollectionCount = 0;

CostumeInfo			g_pCostumeInfo[MAX_COSTUME];
int					g_nCostumeCount = 0;

PetInfo				g_pPetInfo[MAX_PET];
int					g_nPetCount = 0;

MapInfo				g_pMapInfo[MAX_MAP] = { 0, };
int					g_nMapCount = 0;

NpcItemInfo			g_pNpcItemInfo[MAX_NPCITEM];
int					g_nNpcItemCount = 0;

MarketItemPrice		g_pMarketMap[MAX_MARKETMAP];

AuctionItemInfo		g_pMySaleInfo[MAX_SALE] = { 0, };
int					g_nMySaleCount = 0;

AuctionItemInfo		g_pAuctionSaleInfo[MAX_AUCTION] = { 0, };
int					g_nAuctionSaleCount = 0;


int					g_nStoreListCount = 0;
DWORD64				g_qwStoreList[MAX_INVEN * 2];

int					g_nReconnectCount = 0;
DWORD64				g_qwReconnectTime[50] = { 0, };

DWORD64				g_qwLoadingTick = 0;

DWORD64				g_qwUseItemUID = 0;

BOOL				g_bDungeonTele = FALSE;
int					g_nEnterDungeonIdx = NOINDEX;
int					g_nEnterFieldIdx = NOINDEX;

BOOL				g_bRefreshCostume = FALSE;
BOOL				g_bRefreshPet = FALSE;

BOOL				g_bCanGuildDonate = FALSE;

BOOL				g_bRecoverDone = FALSE;

BOOL				g_bReQuestDone = FALSE;

BOOL				g_bRefreshMarket = FALSE;
BOOL				g_bNeedSearchPrice = FALSE;

int					g_nCaoQuestCount = 0;
DWORD				g_pCaoQuestID[MAX_CAOQUEST] = { 0, };

BOOL				g_bSelectDungeon = FALSE;

DWORD64				g_qwSubCategory1 = 0;
DWORD64				g_qwSubCategory2 = 0;
DWORD64				g_qwSubCategory3 = 0;
DWORD64				g_qwSubCategory4 = 0;

// ------------------ Auto Setting ------------------ //

BOOL			g_bScheduleAlert = FALSE;
WCHAR			g_szScheduleName[MAX_NAME] = { 0, };

SCHEDULE_SETTING	g_ScheduleSetting;

MAKE_SETTING	g_MakeSetting;

int					g_nSkillInterval;
SKILL_INTERVAL		g_pSkillInterval[MAX_ITEM];

int				g_nReturnCount = 0;
ITEM_RETURN* g_pReturnInfo = NULL;
HUNT_SETTING	g_HuntSetting;

int				g_nBuyExpendCount = 0;
ITEM_BUY* g_pBuyExpendInfo = NULL;

int				g_nBuyExchangeCount = 0;
ITEM_BUY* g_pBuyExchangeInfo = NULL;

BUY_SETTING		g_BuySetting;

BYTE			g_pItemDefault[MAX_GRADE][MAX_TYPE_1];

int				g_nItemDetailCount = 0;
DETAIL_ITEM* g_pItemDetailInfo = NULL;

OTHER_SETTING	g_OtherSetting;
ITEM_SETTING		g_ItemSetting;

// ------------------ Bug 2024/12/7------------------ //
BOOL			g_PackageShopVisited = FALSE;

// ------------------ ------------------ //



int				g_nDeadCount = 0;
DWORD64			g_qwDeadTime[50] = { 0, };

BOOL			g_bWaitDelay = FALSE;

BYTE			g_bCreateCharActor = 0;
BYTE			g_bCreateCharClass = 0;
BYTE			g_bSnakeDungeon = 0;
BOOL			g_bCountry = 0;
int				g_nCountryID = 0;
BOOL			g_b56002 = 0;
BOOL			g_bSkipDeviceReg = 0;
int				g_nStat1 = 0;
int				g_nStat2 = 0;

Align_Info* g_pAlignInfo = NULL;

HANDLE			g_hClientProcess = NULL;

int				g_nPartyMember = 0;
PARTYMEMBER* g_pPartyMember = NULL;

BYTE			g_nChaoStatusCount = 0;
BYTE			g_pChaoStatusInfo[50];


DWORD64			g_qwKaKaoGameAddr = 0;

unsigned int	g_nCurAddrTime = 0;

BYTE			g_bTcpTable = 0;

DWORD64			g_qwServerTick = 0xFFFFFFFF;
DWORD64			g_qwLastServerTick = 0;

BYTE			g_bAddrLower = 0;

HANDLE			g_hAddrEvent = NULL;
HANDLE			g_hAddrMapping = NULL;

BOOL			g_bFrameEnable = FALSE;
int				g_nFrameValue = 20;

BOOL			g_bRecordStep = FALSE;
BOOL			g_bRecordStop = FALSE;
int				g_nRecordCurStep = 0;
int				g_nRecordMaxStep = -1;
int				g_nRecordStopStep = -1;

ServerRes g_pServerRes[MAX_SERVER] =
{
	{ L"칼데스",			L"卡尔德斯"	},
	{ L"드라카스",		L"德拉克斯"	},
	{ L"브리든",			L"布里登"	},
	{ L"안타리아",		L"安塔利亚"	},
	{ L"실모르",			L"希摩尔"	},
	{ L"카렌",			L"凯伦"		},
	{ L"세바",			L"塞巴"		},
	{ L"크레모",			L"克雷默"	},
	{ L"림스트",			L"林斯特"	},
	{ L"에스켈",			L"埃斯克尔"	},
	{ L"레인베이",		L"雷恩湾"	},
	{ L"다크빌",			L"达克镇"	},
	{ L"나아스",			L"尼亚斯"	},
	{ L"시르페나",		L"西尔佩娜"	},
	{ L"아이미스",		L"伊米斯"	},
};

DungeonRes g_pDungeonRes[MAX_DUNGEON] =
{
	// 일반 던전

	/*00*/	{ L"고대 미궁",			L"远古迷宫",			L"古代迷宮",			0, 0,	11,		1,		5000,		0,	0,	1,	{ 0x00000003 } },			// 고대 미궁 B1 (Lv 1 ~)
	/*01*/	{ L"고대 미궁",			L"远古迷宫",			L"古代迷宮",			0, 1,	11,		1,		14000,		0,	0,	1,	{ 0x00000027 } },			// 고대 미궁 B2 (Lv 44 ~)
	/*02*/	{ L"고대 미궁",			L"远古迷宫",			L"古代迷宮",			0, 1,	11,		1,		18000,		0,	0,	1,	{ 0x00000028 } },			// 고대 미궁 B3 (Lv 62 ~)

	/*03*/	{ L"카타콤",				L"地下墓穴",			L"地下墓穴",			0, 0,	21,		1,		8000,		0,					0,	1,	{ 0x00000009 } },			// 카타콤 B1 (Lv 28 ~)
	/*04*/	{ L"카타콤",				L"地下墓穴",			L"地下墓穴",			0, 1,	21,		1,		15000,		0,					0,	1,	{ 0x00000018 } },			// 카타콤 B2 (Lv 47 ~)
	/*05*/	{ L"카타콤",				L"地下墓穴",			L"地下墓穴",			0, 2,	21,		1,		10,			0,					0,	1,	{ 0x00000026 } },			// 카타콤 B3 (Lv 62 ~)

	/*06*/	{ L"드베르그",			L"迪贝格",			L"德貝格",			0, 0,	31,		1,		16000,		0,					0,	1,	{ 0x00000004 } },			// 드베르그 입구 (Lv 50 ~)
	/*07*/	{ L"드베르그",			L"迪贝格",			L"德貝格",			0, 1,	31,		1,		23000,		0,					0,	1,	{ 0x00000006 } },			// 드베르그 B1 (Lv 67 ~)
	/*08*/	{ L"드베르그",			L"迪贝格",			L"德貝格",			0, 2,	31,		1,		10,			0,					0,	1,	{ 0x00000017 } },			// 드베르그 B2 (Lv 75 ~)

	/*09*/	{ L"사막 동굴",			L"沙漠洞穴",			L"沙漠洞穴",			0, 0,	41,		1,		22000,		0,					0,	1,	{ 0x0000000D } },			// 사막 동굴 B1 (Lv 67 ~)
	/*10*/	{ L"사막 동굴",			L"沙漠洞穴",			L"沙漠洞穴",			0, 1,	41,		1,		30000,		0,					0,	1,	{ 0x00000015 } },			// 사막 동굴 B2 (Lv 79 ~)

	/*11*/	{ L"지하 신전",			L"地下神殿",			L"地下神殿",			0, 0,	51,		1,		22000,		0,					0,	1,	{ 0x00000029 } },			// 지하 신전 B1 (Lv 70~)
	/*12*/	{ L"지하 신전",			L"地下神殿",			L"地下神殿",			0, 1,	51,		1,		23000,		0,					0,	1,	{ 0x0000002A } },			// 지하 신전 B2 (Lv 72~)
	/*13*/	{ L"지하 신전",			L"地下神殿",			L"地下神殿",			0, 2,	51,		1,		25000,		0,					0,	1,	{ 0x00000002 } },			// 지하 신전 B3 (Lv 75~)

	/*14*/	{ L"왕의 무덤",			L"王陵",				L"王陵",				0, 0,	61,		1,		100000,		0,					0,	1,	{ 0x0000002B } },			// 왕의 무덤 입구 (Lv 70 ~)
	/*15*/	{ L"왕의 무덤",			L"王陵",				L"王陵",				0, 1,	61,		1,		0,			ItemID_ElvenScr,	1,	1,	{ 0x0000002C } },			// 왕의 무덤 B1 (Lv 72 ~)
	/*16*/	{ L"왕의 무덤",			L"王陵",				L"王陵",				0, 2,	61,		1,		0,			ItemID_ElvenScr,	1,	1,	{ 0x0000002D } },			// 왕의 무덤 B2 (Lv 74 ~)
	/*17*/	{ L"왕의 무덤",			L"王陵",				L"王陵",				0, 3,	61,		1,		0,			ItemID_ElvenScr,	1,	1,	{ 0x0000002E } },			// 왕의 무덤 B3 (Lv 76 ~)
	/*18*/	{ L"왕의 무덤",			L"王陵",				L"王陵",				0, 4,	61,		1,		0,			ItemID_ElvenScr,	1,	1,	{ 0x0000002F } },			// 왕의 무덤 B4 (Lv 78 ~)
	/*19*/	{ L"왕의 무덤",			L"王陵",				L"王陵",				0, 5,	61,		1,		0,			ItemID_ElvenScr,	1,	1,	{ 0x00000031 } },			// 왕의 무덤 B5 (Lv 80 ~)

	/*20*/	{ L"[W] 아이스 포지",		L"[W] 冰之堡垒",		L"[W] 冰之堡壘",		0, 0,	71,		1,		0,			ItemID_ElvenScr,	1,	1,	{ 0x00000030 } },			// [W] 아이스 포지 입구 (Lv 88 ~)
	/*21*/	{ L"[W] 아이스 포지",		L"[W] 冰之堡垒",		L"[W] 冰之堡壘",		0, 1,	71,		1,		0,			ItemID_ElvenScr,	5,	1,	{ 0x00000033 } },			// [W] 아이스 포지 B1 (Lv 91 ~)
	/*22*/	{ L"[W] 아이스 포지",		L"[W] 冰之堡垒",		L"[W] 冰之堡壘",		0, 2,	71,		1,		0,			ItemID_ElvenScr,	10,	1,	{ 0x00000038 } },			// [W] 아이스 포지 B2 (Lv 94 ~)

	/*23*/	{ L"[W] 엘프의 안식처",	L"[W] 精灵安息处",	L"[W] 精靈安息處",	0, 0,	81,		1,		0,			ItemID_ElvenScr,	1,	1,	{ 0x00000032 } },			// [W] 엘프의 안식처 입구 (Lv 92 ~)
	/*24*/	{ L"[W] 엘프의 안식처",	L"[W] 精灵安息处",	L"[W] 精靈安息處",	0, 1,	81,		1,		0,			ItemID_ElvenScr,	5,	1,	{ 0x00000039 } },			// [W] 엘프의 안식처 B1 (Lv 95 ~)

	/*25*/	{ L"[W] 마녀의 은신처",	L"[W] 魔女的藏身处",	L"[W] 魔女的藏身處",	0, 0,	91,		1,		0,			ItemID_ElvenScr,	1,	1,	{ 0x00000035 } },			// [W] 마녀의 은신처

	// 특수 던전

	/*26*/	{ L"정복자의 안식처",		L"征服者安息处",		L"征服者安息處",		1, 0,	11,		40,		5000,		0,	0,	3,	{ 0x000017DA, 0x000017DB, 0x000017DC } },			// 정복자의 안식처 입장 레벨 (Lv 40 ~ Lv 60)
	/*27*/	{ L"정복자의 안식처",		L"征服者安息处",		L"征服者安息處",		1, 1,	11,		55,		100000,		0,	0,	3,	{ 0x00001771, 0x00001776, 0x000017D5 } },			// 정복자의 안식처 입장 레벨 (Lv 55 ~ Lv 70)
	/*28*/	{ L"정복자의 안식처",		L"征服者安息处",		L"征服者安息處",		1, 2,	11,		65,		200000,		0,	0,	3,	{ 0x00001772, 0x00001777, 0x000017D6 } },			// 정복자의 안식처 입장 레벨 (Lv 65 ~ Lv 75)
	/*29*/	{ L"정복자의 안식처",		L"征服者安息处",		L"征服者安息處",		1, 3,	11,		70,		300000,		0,	0,	3,	{ 0x00001773, 0x00001778, 0x000017D7 } },			// 정복자의 안식처 입장 레벨 (Lv 70 ~ Lv 80)
	/*30*/	{ L"정복자의 안식처",		L"征服者安息处",		L"征服者安息處",		1, 4,	11,		75,		400000,		0,	0,	3,	{ 0x00001774, 0x00001779, 0x000017D8 } },			// 정복자의 안식처 입장 레벨 (Lv 75 ~ Lv 85)
	/*31*/	{ L"정복자의 안식처",		L"征服者安息处",		L"征服者安息處",		1, 5,	11,		80,		500000,		0,	0,	3,	{ 0x00001775, 0x0000177A, 0x000017D9 } },			// 정복자의 안식처 입장 레벨 (Lv 80 ~ Lv 95)

	/*32*/	{ L"엘프의 광산",			L"精灵的矿山",		L"精靈的礦山",		1, 0,	12,		60,		10000,		0,	0,	3,	{ 0x0000045C, 0x000004C0, 0x00000524 } },			// 엘프의 광산 입장 레벨 (Lv 60 ~)
	/*33*/	{ L"엘프의 광산",			L"精灵的矿山",		L"精靈的礦山",		1, 1,	12,		65,		10000,		0,	0,	3,	{ 0x0000045D, 0x000004C1, 0x00000525 } },			// 엘프의 광산 입장 레벨 (Lv 65 ~)
	/*34*/	{ L"엘프의 광산",			L"精灵的矿山",		L"精靈的礦山",		1, 2,	12,		70,		10000,		0,	0,	3,	{ 0x0000045E, 0x000004C2, 0x00000526 } },			// 엘프의 광산 입장 레벨 (Lv 70 ~)
	/*35*/	{ L"엘프의 광산",			L"精灵的矿山",		L"精靈的礦山",		1, 3,	12,		75,		10000,		0,	0,	3,	{ 0x0000045F, 0x000004C3, 0x00000527 } },			// 엘프의 광산 입장 레벨 (Lv 75 ~)
	/*36*/	{ L"엘프의 광산",			L"精灵的矿山",		L"精靈的礦山",		1, 4,	12,		80,		2,			0,	0,	3,	{ 0x00000460, 0x000004C4, 0x00000528 } },			// 엘프의 광산 입장 레벨 (Lv 80 ~)
	/*37*/	{ L"엘프의 광산",			L"精灵的矿山",		L"精靈的礦山",		1, 5,	12,		85,		3,			0,	0,	3,	{ 0x0000046F, 0x000004D3, 0x00000537 } },			// 엘프의 광산 입장 레벨 (Lv 85 ~)

	/*38*/	{ L"환영의 유적",			L"幻影遗迹",			L"幻影的遺跡",		1, 0,	13,		30,		10000,		0,	0,	3,	{ 0x00000456, 0x000004BA, 0x0000051E } },			// 환영의 유적 입장 레벨 (Lv 30 ~)
	/*39*/	{ L"환영의 유적",			L"幻影遗迹",			L"幻影的遺跡",		1, 1,	13,		40,		10000,		0,	0,	3,	{ 0x0000044D, 0x000004B1, 0x00000515 } },			// 환영의 유적 입장 레벨 (Lv 40 ~)
	/*40*/	{ L"환영의 유적",			L"幻影遗迹",			L"幻影的遺跡",		1, 2,	13,		50,		10000,		0,	0,	3,	{ 0x00000459, 0x000004BD, 0x00000521 } },			// 환영의 유적 입장 레벨 (Lv 50 ~)
	/*41*/	{ L"환영의 유적",			L"幻影遗迹",			L"幻影的遺跡",		1, 3,	13,		60,		10000,		0,	0,	3,	{ 0x00000450, 0x000004B4, 0x00000518 } },			// 환영의 유적 입장 레벨 (Lv 60 ~)
	/*42*/	{ L"환영의 유적",			L"幻影遗迹",			L"幻影的遺跡",		1, 4,	13,		70,		10000,		0,	0,	3,	{ 0x00000453, 0x000004B7, 0x0000051B } },			// 환영의 유적 입장 레벨 (Lv 70 ~)
	/*43*/	{ L"환영의 유적",			L"幻影遗迹",			L"幻影的遺跡",		1, 5,	13,		75,		1,			0,	0,	3,	{ 0x00000466, 0x000004CA, 0x0000052E } },			// 환영의 유적 입장 레벨 (Lv 75 ~)
	/*44*/	{ L"환영의 유적",			L"幻影遗迹",			L"幻影的遺跡",		1, 6,	13,		80,		2,			0,	0,	3,	{ 0x00000467, 0x000004CB, 0x0000052F } },			// 환영의 유적 입장 레벨 (Lv 80 ~)
	/*45*/	{ L"환영의 유적",			L"幻影遗迹",			L"幻影的遺跡",		1, 7,	13,		85,		3,			0,	0,	3,	{ 0x0000046C, 0x000004D0, 0x00000534 } },			// 환영의 유적 입장 레벨 (Lv 85 ~)

	/*46*/	{ L"시간의 미궁",			L"时间迷宫",			L"時間迷宮",			1, 0,	14,		30,		10000,		0,	0,	3,	{ 0x00000457, 0x000004BB, 0x0000051F } },			// 시간의 미궁 입장 레벨 (Lv 30 ~)
	/*47*/	{ L"시간의 미궁",			L"时间迷宫",			L"時間迷宮",			1, 1,	14,		40,		10000,		0,	0,	3,	{ 0x0000044E, 0x000004B2, 0x00000516 } },			// 시간의 미궁 입장 레벨 (Lv 40 ~)
	/*48*/	{ L"시간의 미궁",			L"时间迷宫",			L"時間迷宮",			1, 2,	14,		50,		10000,		0,	0,	3,	{ 0x0000045A, 0x000004BE, 0x00000522 } },			// 시간의 미궁 입장 레벨 (Lv 50 ~)
	/*49*/	{ L"시간의 미궁",			L"时间迷宫",			L"時間迷宮",			1, 3,	14,		60,		10000,		0,	0,	3,	{ 0x00000451, 0x000004B5, 0x00000519 } },			// 시간의 미궁 입장 레벨 (Lv 60 ~)
	/*50*/	{ L"시간의 미궁",			L"时间迷宫",			L"時間迷宮",			1, 4,	14,		70,		10000,		0,	0,	3,	{ 0x00000454, 0x000004B8, 0x0000051C } },			// 시간의 미궁 입장 레벨 (Lv 70 ~)
	/*51*/	{ L"시간의 미궁",			L"时间迷宫",			L"時間迷宮",			1, 5,	14,		75,		1,			0,	0,	3,	{ 0x00000468, 0x000004CC, 0x00000530 } },			// 시간의 미궁 입장 레벨 (Lv 75 ~)
	/*52*/	{ L"시간의 미궁",			L"时间迷宫",			L"時間迷宮",			1, 6,	14,		80,		2,			0,	0,	3,	{ 0x00000469, 0x000004CD, 0x00000531 } },			// 시간의 미궁 입장 레벨 (Lv 80 ~)
	/*53*/	{ L"시간의 미궁",			L"时间迷宫",			L"時間迷宮",			1, 7,	14,		85,		3,			0,	0,	3,	{ 0x0000046D, 0x000004D1, 0x00000535 } },			// 시간의 미궁 입장 레벨 (Lv 85 ~)

	/*54*/	{ L"얼음 신전",			L"寒冰神殿",			L"冰凍神殿",			1, 0,	15,		30,		10000,		0,	0,	3,	{ 0x00000458, 0x000004BC, 0x00000520 } },			// 얼음 신전 입장 레벨 (Lv 30 ~)
	/*55*/	{ L"얼음 신전",			L"寒冰神殿",			L"冰凍神殿",			1, 1,	15,		40,		10000,		0,	0,	3,	{ 0x0000044F, 0x000004B3, 0x00000517 } },			// 얼음 신전 입장 레벨 (Lv 40 ~)
	/*56*/	{ L"얼음 신전",			L"寒冰神殿",			L"冰凍神殿",			1, 2,	15,		50,		10000,		0,	0,	3,	{ 0x0000045B, 0x000004BF, 0x00000523 } },			// 얼음 신전 입장 레벨 (Lv 50 ~)
	/*57*/	{ L"얼음 신전",			L"寒冰神殿",			L"冰凍神殿",			1, 3,	15,		60,		10000,		0,	0,	3,	{ 0x00000452, 0x000004B6, 0x0000051A } },			// 얼음 신전 입장 레벨 (Lv 60 ~)
	/*58*/	{ L"얼음 신전",			L"寒冰神殿",			L"冰凍神殿",			1, 4,	15,		70,		10000,		0,	0,	3,	{ 0x00000455, 0x000004B9, 0x0000051D } },			// 얼음 신전 입장 레벨 (Lv 70 ~)
	/*59*/	{ L"얼음 신전",			L"寒冰神殿",			L"冰凍神殿",			1, 5,	15,		75,		1,			0,	0,	3,	{ 0x0000046A, 0x000004CE, 0x00000532 } },			// 얼음 신전 입장 레벨 (Lv 75 ~)
	/*60*/	{ L"얼음 신전",			L"寒冰神殿",			L"冰凍神殿",			1, 6,	15,		80,		2,			0,	0,	3,	{ 0x0000046B, 0x000004CF, 0x00000533 } },			// 얼음 신전 입장 레벨 (Lv 80 ~)
	/*61*/	{ L"얼음 신전",			L"寒冰神殿",			L"冰凍神殿",			1, 7,	15,		85,		3,			0,	0,	3,	{ 0x0000046E, 0x000004D2, 0x00000536 } },			// 얼음 신전 입장 레벨 (Lv 85 ~)

	// 층마다 클리어 하는 던전

	/*62*/	{ L"혼돈의 성채",			L"混吨城堡",			L"混沌城堡",			1, 0,	16,		50,		50000,		0,	0,	1,	{ 0x00000BB9 } },			// 혼돈의 성채 1층 (Lv 50 ~)
	/*63*/	{ L"혼돈의 성채",			L"混吨城堡",			L"混沌城堡",			1, 1,	16,		70,		30,			0,	0,	1,	{ 0x00000BBA } },			// 혼돈의 성채 2층 (Lv 70 ~)
	/*64*/	{ L"혼돈의 성채",			L"混吨城堡",			L"混沌城堡",			1, 2,	16,		80,		100,		0,	0,	1,	{ 0x00000BBB } },			// 혼돈의 성채 2층 (Lv 80 ~)
	/*65*/	{ L"정령의 성채",			L"精灵城堡",			L"精靈城堡",			1, 0,	17,		50,		50000,		0,	0,	1,	{ 0x00000BC3 } },			// 정령의 성채 1층 (Lv 50 ~)
	/*66*/	{ L"정령의 성채",			L"精灵城堡",			L"精靈城堡",			1, 1,	17,		70,		30,			0,	0,	1,	{ 0x00000BC4 } },			// 정령의 성채 2층 (Lv 70 ~)
	/*67*/	{ L"정령의 성채",			L"精灵城堡",			L"精靈城堡",			1, 2,	17,		80,		100,		0,	0,	1,	{ 0x00000BC5 } },			// 정령의 성채 2층 (Lv 80 ~)

	// 심연의 성역

	/*68*/	{ L"파메즈의 황혼",		L"帕梅兹的黄昏",		L"帕梅茲的黃昏",		2, 0,	11,		40,		0,			0,	0,	2,	{ 6011, 6016 } },
	/*69*/	{ L"마기오스의 원한",		L"玛吉欧斯的怨恨",		L"馬基歐斯的怨恨",		2, 0,	21,		40,		0,			0,	0,	2,	{ 6012, 6017 } },
	/*70*/	{ L"아크딘의 안식처",		L"艾克丁的安息地",		L"阿克丁的安息處",		2, 0,	31,		40,		0,			0,	0,	2,	{ 6013, 6018 } },
	/*71*/	{ L"아라마네드의 격노",	L"阿拉玛内德之怒",		L"阿拉曼奈德的暴怒",	2, 0,	41,		40,		0,			0,	0,	2,	{ 6014, 6019 } },
	/*72*/	{ L"키르세아의 심판",		L"基尔塞亚的审判",		L"基爾賽亞的審判",		2, 0,	51,		40,		0,			0,	0,	2,	{ 6015, 6020 } },
	/*73*/	{ L"아퀴스티아의 절망",	L"阿奎斯蒂亚的绝望",	L"阿奎斯蒂亞的絕望",	2, 0,	61,		65,		0,			0,	0,	4,	{ 6502, 6503, 6504, 6505 } },
};

FieldRes g_pFieldRes[MAX_FIELD] =
{
	{ L"01. 고대 미궁 B1",		L"01. 远古迷宫B1",			5000,		0,					0,		0x00000001,		0x00000003 },
	{ L"02. 윈드롱",				L"02. 云德隆",			6000,		0,					0,		0x00000001,		0x0000000E },
	{ L"03. 데스 밸리",			L"03. 死亡谷",			6000,		0,					0,		0x00000001,		0x00000001 },
	{ L"04. 숨겨진 해안",			L"04. 隐藏海岸",			7000,		0,					0,		0x00000001,		0x00000005 },
	{ L"05. 어둠 숲",				L"05. 黑暗森林",			7000,		0,					0,		0x00000001,		0x00000020 },
	{ L"06. 림스트",				L"06. 林斯特",			8000,		0,					0,		0x00000001,		0x0000000F },
	{ L"13. 고대 미궁 B2",		L"13. 远古迷宫B2",			14000,		0,					0,		0x00000001,		0x00000027 },
	{ L"20. 고대 미궁 B3",		L"20. 远古迷宫B3",			18000,		0,					0,		0x00000001,		0x00000028 },
	{ L"42. 칼데스 성",			L"42. 卡尔德斯城",			5000,		0,					0,		0x00000001,		0x0000000C },

	{ L"08. 불의 평원",			L"08. 火之平原",			9000,		0,					0,		0x00000002,		0x00000013 },
	{ L"09. 세바 오아시스",		L"09. 塞巴绿洲",			9000,		0,					0,		0x00000002,		0x00000014 },
	{ L"14. 카렌 화산",			L"14. 凯伦火山",			15000,		0,					0,		0x00000002,		0x00000012 },
	{ L"16. 드베르그",			L"16. 迪贝格",			16000,		0,					0,		0x00000002,		0x00000004 },
	{ L"19. 아카마 소금 사막",		L"19. 阿卡玛盐漠",			17000,		0,					0,		0x00000002,		0x0000001B },
	{ L"23. 세바 폐허",			L"23. 塞巴废墟",			22000,		0,					0,		0x00000002,		0x0000001D },
	{ L"24. 사막 동굴 B1",		L"24. 沙漠洞穴B1",			22000,		0,					0,		0x00000002,		0x0000000D },
	{ L"25. 드베르그 B1",			L"25. 迪贝格B1",			23000,		0,					0,		0x00000002,		0x00000006 },
	{ L"32. 드베르그 B2",			L"32. 迪贝格B2",			10,			0,					0,		0x00000002,		0x00000017 },
	{ L"35. 사막 동굴 B2",		L"35. 沙漠洞穴B2",			30000,		0,					0,		0x00000002,		0x00000015 },
	{ L"54. 그림자 섬",			L"54. 影子岛",			50000,		0,					0,		0x00000002,		0x00000036 },

	{ L"10. 악어 숲",				L"10. 鳄鱼森林",			10000,		0,					0,		0x00000003,		0x00000008 },
	{ L"17. 크레모 호수",			L"17. 克雷默湖",			16000,		0,					0,		0x00000003,		0x00000011 },
	{ L"18. 레인베이",			L"18. 雷恩湾",			17000,		0,					0,		0x00000003,		0x0000001F },
	{ L"26. 끝없는 정글",			L"26. 无尽的雨林",			23000,		0,					0,		0x00000003,		0x0000001E },
	{ L"29. 에스켈",				L"29. 埃斯克尔",			24000,		0,					0,		0x00000003,		0x00000007 },

	{ L"11. 린포트",				L"11. 林波特",			13000,		0,					0,		0x00000004,		0x00000010 },
	{ L"27. 지하 신전 B1",		L"27. 地下神殿B1",			22000,		0,					0,		0x00000004,		0x00000029 },
	{ L"28. 지하 신전 B2",		L"28. 地下神殿B2",			23000,		0,					0,		0x00000004,		0x0000002A },
	{ L"30. 리베르 유적지",		L"30. 利贝尔遗迹",			24000,		0,					0,		0x00000004,		0x0000000B },
	{ L"31. 지하 신전 B3",		L"31. 地下神殿B3",			25000,		0,					0,		0x00000004,		0x00000002 },
	{ L"36. 카렘 농장",			L"36. 卡雷姆农场",			30000,		0,					0,		0x00000004,		0x0000001A },
	{ L"37. 파미르 고원",			L"37. 帕米尔高原",			30000,		0,					0,		0x00000004,		0x00000022 },
	{ L"38. 안타칸 평원",			L"38. 安塔坎村",			30000,		0,					0,		0x00000004,		0x00000023 },
	{ L"43. 수중 회랑",			L"43. 水中回廊",			100000,		0,					0,		0x00000004,		0x00000065 },

	{ L"07. 카타콤 B1",			L"07. 地下墓穴B1",			8000,		0,					0,		0x00000005,		0x00000009 },
	{ L"12. 안개 계곡",			L"12. 迷雾之谷",			14000,		0,					0,		0x00000005,		0x0000001C },
	{ L"15. 카타콤 B2",			L"15. 地下墓穴B2",			15000,		0,					0,		0x00000005,		0x00000018 },
	{ L"21. 얼음 항구",			L"21. 寒冰港口",			18000,		0,					0,		0x00000005,		0x00000016 },
	{ L"22. 카타콤 B3",			L"22. 地下墓穴B3",			10,			0,					0,		0x00000005,		0x00000026 },
	{ L"33. 베른 산맥",			L"33. 贝伦山脉",			26000,		0,					0,		0x00000005,		0x00000019 },
	{ L"34. 다크빌",				L"34. 达克镇",			29000,		0,					0,		0x00000005,		0x00000024 },
	{ L"39. 켄타우스 협곡",		L"39. 肯塔斯峡谷",			30000,		0,					0,		0x00000005,		0x00000021 },
	{ L"40. 노스링 빙하",			L"40. 诺斯林冰河",			30000,		0,					0,		0x00000005,		0x00000025 },
	{ L"41. 시라산",				L"41. 希拉山",			30000,		0,					0,		0x00000005,		0x0000000A },
	{ L"52. 서리호수",			L"52. 寒霜湖",			40000,		0,					0,		0x00000005,		0x00000034 },

	{ L"44. 거인의 정원",			L"44. 巨人花园",			0,			ItemID_ElvenScr,	1,		0x00000006,		0x00000067 },
	{ L"45. 헤이븐 성",			L"45. 避风港城",			0,			ItemID_ElvenScr,	1,		0x00000006,		0x00000066 },
	{ L"46. 은빛 호수",			L"46. 银色湖泊",			0,			ItemID_ElvenScr,	1,		0x00000006,		0x00000069 },
	{ L"47. 윈드레아",			L"47. 温德雷亚",			0,			ItemID_ElvenScr,	1,		0x00000006,		0x0000006A },
	{ L"48. 살렌드로",			L"48. 萨伦德罗",			0,			ItemID_ElvenScr,	1,		0x00000006,		0x00000068 },
	{ L"49. [W] 아이스 포지",		L"49. [W] 冰之堡垒",		0,			ItemID_ElvenScr,	1,		0x00000006,		0x00000030 },
	{ L"51. [W] 아이스 포지 B1",	L"51. [W] 冰之堡垒 B1",	0,			ItemID_ElvenScr,	5,		0x00000006,		0x00000033 },
	{ L"53. [W] 마녀의 은신처",	L"53. [W] 魔女的藏身处",	0,			ItemID_ElvenScr,	1,		0x00000006,		0x00000035 },
	{ L"55. [W] 아이스 포지 B2",	L"55. [W] 冰之堡垒 B2",	0,			ItemID_ElvenScr,	10,		0x00000006,		0x00000038 },
};

CashItemInfo g_pCashItemInfo[MAX_CASHITEM] =
{
	//																				ID				Main	Sub		SubDetail		Cur		Max		Lv		CashType			nPrice	OnSale
	/*02*/	{ L"일반 체력 회복제",						L"普通体力恢复药水",				401173201,		3,		2,		0,				0,		200,	0,		eCashType_GOLD,		100,		1 },
	/*03*/	{ L"상급 체력 회복제",						L"优质体力恢复药水",				401173202,		3,		2,		0,				0,		200,	0,		eCashType_GOLD,		500,		1 },
	/*04*/	{ L"거점 귀환 주문서",						L"据点回归卷轴",					401173203,		3,		2,		0,				0,		20,		0,		eCashType_GOLD,		1100,		1 },
	/*05*/	{ L"무기 강화 주문서",						L"武器强化卷轴",					401173204,		3,		2,		0,				0,		5,		0,		eCashType_GOLD,		70000,		1 },
	/*06*/	{ L"방어구 강화 주문서",					L"防具强化卷轴",					401173205,		3,		2,		0,				0,		5,		0,		eCashType_GOLD,		30000,		1 },
	/*07*/	{ L"일반 장비 상자",						L"普通装备宝箱",					401173208,		3,		2,		0,				0,		5,		0,		eCashType_GOLD,		200000,		1 },
	/*08*/	{ L"에린도르의 서약",						L"埃林多尔的誓约",					401173206,		3,		2,		0,				0,		2,		0,		eCashType_DIA,		400,		1 },
	/*09*/	{ L"기억의 스크롤",						L"记忆卷轴",						401173207,		3,		2,		0,				0,		0,		0,		eCashType_DIA,		400,		1 },
	/*10*/	{ L"엘븐 스크롤",							L"精灵卷轴",						401173216,		3,		2,		0,				0,		0,		0,		eCashType_GOLD,		200000,		1 },

	/*11*/	{ L"크리스탈 랜덤 상자",					L"水晶随机宝箱",					401174202,		4,		2,		0,				0,		2,		0,		eCashType_GOLD,		157000,		1 },
	/*12*/	{ L"최상급 가디언 소환 1회",				L"召唤1次顶级守护者",				401172201,		2,		2,		0,				0,		0,		0,		eCashType_CRYSTAL,	1000,		1 },
	/*13*/	{ L"최상급 가디언 소환 11회",				L"召唤11次顶级守护者",				401172202,		2,		2,		0,				0,		0,		0,		eCashType_CRYSTAL,	10000,		1 },

	/*14*/	{ L"중급 코스튬 소환 (골드) 1회",			L"召唤1次中級时装 (金币)",			401172301,		2,		3,		0,				0,		1,		30,		eCashType_GOLD,		30000,		1 },
	/*15*/	{ L"상급 코스튬 소환 (골드) 1회",			L"召唤1次高级时装 (金币)",			401172302,		2,		3,		0,				0,		1,		40,		eCashType_GOLD,		50000,		1 },
	/*16*/	{ L"최상급 코스튬 소환 (골드) 1회",			L"召唤1次顶级时装 (金币)",			401172303,		2,		3,		0,				0,		1,		50,		eCashType_GOLD,		90000,		1 },
	/*17*/	{ L"중급 가디언 소환 (골드) 1회",			L"召唤1次中級守护者 (金币)",		401172304,		2,		3,		0,				0,		1,		30,		eCashType_GOLD,		30000,		1 },
	/*18*/	{ L"상급 가디언 소환 (골드) 1회",			L"召唤1次高级守护者 (金币)",		401172305,		2,		3,		0,				0,		1,		40,		eCashType_GOLD,		50000,		1 },
	/*19*/	{ L"최상급 가디언 소환 (골드) 1회",			L"召唤1次顶级守护者 (金币)",		401172306,		2,		3,		0,				0,		1,		50,		eCashType_GOLD,		90000,		1 },
	/*20*/	{ L"중급 몬스터 석판 소환 (골드) 1회",		L"召唤1次中級怪物石板 (金币)",		401172307,		2,		3,		0,				0,		1,		55,		eCashType_GOLD,		50000,		1 },
	/*21*/	{ L"상급 몬스터 석판 소환 (골드) 1회",		L"召唤1次高级怪物石板 (金币)",		401172308,		2,		3,		0,				0,		1,		60,		eCashType_GOLD,		100000,		1 },
	/*22*/	{ L"최상급 몬스터 석판 소환 (골드) 1회",		L"召唤1次顶级怪物石板 (金币)",		401172309,		2,		3,		0,				0,		1,		65,		eCashType_GOLD,		200000,		1 },

	/*23*/	{ L"100일 기념 패키지 I",					L"100日纪念礼包 I",				401171106,		1,		1,		0,				0,		1,		65,		eCashType_GOLD,		100,		1 },
};

MakeRes g_pMakeRes[MAX_MAKERES] =
{
	{	// 00
		L"일반 장비 상자 (귀속)",				2,	1,	8,	90511101,	0,
		2,
		{
			{ L"일반 장비 파편 (귀속)",		10703108,	1,	20,		0 },
			{ L"골드",						1,			1,	5000,	0 },
		}
	},

	{	// 01
		L"일반 장비 상자 (귀속)",				2,	1,	8,	90511102,	0,
		2,
		{
			{ L"고급 장비 파편 (귀속)",		10703214,	1,	10,		0 },
			{ L"골드",						1,			1,	5000,	0 },
		}
	},

	{	// 02
		L"상급 장비 상자 (귀속)",				2,	1,	8,	90511103,	0,
		2,
		{
			{ L"일반 장비 상자 (귀속)",		10511101,	1,	20,		0 },
			{ L"골드",						1,			1,	10000,	0 },
		}
	},

	{	// 03
		L"최상급 장비 상자 (귀속)",			2,	1,	8,	90511110,	0,
		4,
		{
			{ L"상급 장비 상자 (귀속)",		10511202,	1,	5,		0 },
			{ L"심연의 가루 (귀속)",			10703111,	1,	500,	0 },
			{ L"골드",						1,			1,	2000000,0 },
			{ L"명예주화",					12,			1,	5000,	0 },
		}
	},

	{	// 04
		L"크리스탈 랜덤 상자 (귀속)",			2,	1,	8,	90511106,	0,
		3,
		{
			{ L"크리스탈 원석 (귀속)",			10703119,	1,	20,		0 },
			{ L"칼데라스의 증표 (귀속)",		10703117,	1,	500,	0 },
			{ L"골드",						1,			1,	100000,	0 },
		}
	},

	{	// 05
		L"일반 가디언 석판 (1회) (귀속)",		2,	1,	5,	91513102,	0,
		3,
		{
			{ L"일반 가디언 석판 조각 (귀속)",	10703116,	1,	20,		0 },
			{ L"칼데라스의 증표 (각인)",		10703117,	1,	10,		0 },
			{ L"골드",						1,			1,	10000,	0 },
		}
	},

	{	// 06
		L"고급 가디언 석판 (1회) (귀속)",		2,	1,	5,	91513201,	0,
		3,
		{
			{ L"고급 가디언 석판 조각 (귀속)",	10703213,	1,	10,		0 },
			{ L"칼데라스의 증표 (각인)",		10703117,	1,	100,	0 },
			{ L"골드",						1,			1,	50000,	0 },
		}
	},

	{	// 07
		L"일반 몬스터 석판 (1회) (귀속)",		2,	1,	6,	91521101,	0,
		3,
		{
			{ L"일반 몬스터 석판 조각 (귀속)",	10703115,	1,	20,		0 },
			{ L"칼데라스의 증표 (각인)",		10703117,	1,	10,		0 },
			{ L"골드",						1,			1,	10000,	0 },
		}
	},

	{	// 08
		L"고급 몬스터 석판 (1회) (귀속)",		2,	1,	6,	91521201,	0,
		3,
		{
			{ L"고급 몬스터 석판 조각 (귀속)",	10703211,	1,	10,		0 },
			{ L"칼데라스의 증표 (각인)",		10703117,	1,	100,	0 },
			{ L"골드",						1,			1,	50000,	0 },
		}
	},

	{	// 09
		L"희귀 세공석 (귀속)",					2,	1,	7,	90613301,	0,
		3,
		{
			{ L"심연의 가루 (귀속)",			10703111,	1,	50,		0 },
			{ L"칼데라스의 증표 (각인)",		10703117,	1,	5,		0 },
			{ L"골드",						1,			1,	5000,	0 },
		}
	},

	{	// 10
		L"영웅 세공석 (귀속)",					2,	1,	7,	90613401,	0,
		3,
		{
			{ L"심연의 가루 (귀속)",			10703111,	1,	150,	0 },
			{ L"칼데라스의 증표 (각인)",		10703117,	1,	50,		0 },
			{ L"골드",						1,			1,	10000,	0 },
		}
	},

	{	// 11
		L"전설 세공석 (귀속)",					2,	1,	7,	90613501,	0,
		3,
		{
			{ L"심연의 가루 (귀속)",			10703111,	1,	300,	0 },
			{ L"칼데라스의 증표 (각인)",		10703117,	1,	500,	0 },
			{ L"골드",						1,			1,	50000,	0 },
		}
	},

	{	// 12
		L"유물 세공석 (귀속)",					2,	1,	7,	90613801,	0,
		4,
		{
			{ L"희귀 장비 파편 (귀속)",		10703325,	1,	3,		0 },
			{ L"심연의 가루 (귀속)",			10703111,	1,	200,	0 },
			{ L"칼데라스의 증표 (각인)",		10703117,	1,	350,	0 },
			{ L"골드",						1,			1,	100000,	0 },
		}
	},

	{	// 13
		L"중급 마석",							2,	2,	1,	90703206,	0,
		2,
		{
			{ L"마석",						10703106,	1,	10,		0 },
			{ L"골드",						1,			1,	1000,	0 },
		}
	},

	{	// 14
		L"상급 마석",							2,	2,	1,	90703311,	0,
		2,
		{
			{ L"중급 마석",					10703206,	1,	10,		0 },
			{ L"골드",						1,			1,	5000,	0 },
		}
	},

	{	// 15
		L"중급 목재",							2,	2,	1,	90703205,	0,
		2,
		{
			{ L"목재",						10703105,	1,	10,		0 },
			{ L"골드",						1,			1,	1000,	0 },
		}
	},

	{	// 16
		L"상급 목재",							2,	2,	1,	90703310,	0,
		2,
		{
			{ L"중급 목재",					10703205,	1,	10,		0 },
			{ L"골드",						1,			1,	5000,	0 },
		}
	},

	{	// 17
		L"중급 가죽",							2,	2,	1,	90703204,	0,
		2,
		{
			{ L"가죽",						10703104,	1,	10,		0 },
			{ L"골드",						1,			1,	1000,	0 },
		}
	},

	{	// 18
		L"상급 가죽",							2,	2,	1,	90703309,	0,
		2,
		{
			{ L"중급 가죽",					10703204,	1,	10,		0 },
			{ L"골드",						1,			1,	5000,	0 },
		}
	},

	{	// 19
		L"중급 천",							2,	2,	1,	90703203,	0,
		2,
		{
			{ L"천",							10703103,	1,	10,		0 },
			{ L"골드",						1,			1,	1000,	0 },
		}
	},

	{	// 20
		L"상급 천",							2,	2,	1,	90703308,	0,
		2,
		{
			{ L"중급 천",						10703203,	1,	10,		0 },
			{ L"골드",						1,			1,	5000,	0 },
		}
	},

	{	// 21
		L"중급 보석",							2,	2,	1,	90703202,	0,
		2,
		{
			{ L"보석",						10703102,	1,	10,		0 },
			{ L"골드",						1,			1,	1000,	0 },
		}
	},

	{	// 22
		L"상급 보석",							2,	2,	1,	90703307,	0,
		2,
		{
			{ L"중급 보석",					10703202,	1,	10,		0 },
			{ L"골드",						1,			1,	5000,	0 },
		}
	},

	{	// 23
		L"중급 철괴",							2,	2,	1,	90703201,	0,
		2,
		{
			{ L"철괴",						10703101,	1,	10,		0 },
			{ L"골드",						1,			1,	1000,	0 },
		}
	},

	{	// 24
		L"상급 철괴",							2,	2,	1,	90703306,	0,
		2,
		{
			{ L"중급 철괴",					10703201,	1,	10,		0 },
			{ L"골드",						1,			1,	5000,	0 },
		}
	},



	{
		L"무기 강화 주문서 (귀속)",			2,	1,	1,	91602101,	0,
		2,
		{
			{ L"심연의 가루 (귀속)",			10703111,	1,	50,		0 },
			{ L"칼데라스의 증표 (귀속)",		10703117,	1,	10,		0 },
		}
	},

	{
		L"방어구 강화 주문서 (귀속)",			2,	1,	1,	91603101,	0,
		2,
		{
			{ L"심연의 가루 (귀속)",			10703111,	1,	50,		0 },
			{ L"칼데라스의 증표 (귀속)",		10703117,	1,	10,		0 },
		}
	},

	{
		L"장신구 강화 주문서 (귀속)",			2,	1,	1,	91604101,	0,
		4,
		{
			{ L"무기 강화 주문서",				ItemID_WeaponScr1,	1,	1,		0 },
			{ L"방어구 강화 주문서",			ItemID_ArmorScr1,	1,	1,		0 },
			{ L"칼데라스의 증표 (귀속)",		10703117,	1,	5,		0 },
			{ L"골드",						1,			1,	10000,	0 },
		}
	},

	{
		L"에린도르 정수 (귀속)",				2,	1,	1,	90622101,	0,
		2,
		{
			{ L"에린도르 파편 (귀속)",			10703140,	1,	15,		0 },
			{ L"골드",						1,			1,	10000,	0 },
		}
	},

	{
		L"근위대 희귀 장비 도면 (귀속)",		3,	1,	0,	90703101,	0,
		2,
		{
			{ L"근위대 희귀 장비 도면 조각 (귀속)",	10703324,	1,	10,		0 },
			{ L"골드",						1,			1,	50000,	0 },
		}
	},
};

QuickSlotRes g_pQuickSlotRes[MAX_QUICKSLOTRES] =
{
	{ L"텔레포트 주문서",					ItemID_TelScroll,		ePlayerClass_PC_COMMON		},
	{ L"거점 귀환 주문서",					ItemID_RetScroll,		ePlayerClass_PC_COMMON		},
	{ L"각성의 물약",						ItemID_BufPotion,		ePlayerClass_PC_COMMON		},
	{ L"강인한 소고기 스테이크",			ItemID_BufFood1,		ePlayerClass_PC_KNIGHT		},
	{ L"민첩한 양고기 스튜",				ItemID_BufFood2,		ePlayerClass_PC_RANGER		},
	{ L"지혜로운 두부 볶음",				ItemID_BufFood3,		ePlayerClass_PC_MAGICIAN	},
	{ L"성장 강화제 (귀속)",				105031041,				ePlayerClass_PC_COMMON		},
	{ L"공속의 물약 (귀속)",				105031061,				ePlayerClass_PC_COMMON		},
	{ L"이속의 물약 (귀속)",				105031071,				ePlayerClass_PC_COMMON		},
	{ L"레드 와인 (귀속)",				105033011,				ePlayerClass_PC_COMMON		},
};

int GetFieldIndex(WCHAR* pszName)
{
	for (int i = 0; i < MAX_FIELD; i++)
	{
		if (!wcscmp(g_pFieldRes[i].szKRName, pszName) || !wcscmp(g_pFieldRes[i].szTWName, pszName))
			return i;
	}

	return NOINDEX;
}