#pragma once

// Name: , Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x1)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class CommonSource.AchievementTable
// 0x0030 (0x0058 - 0x0028)
class UCommonSource_AchievementTable : public UObject
{
public:
	class UCommonSource_AchievementInfoSheet*          m_AchievementInfoSheet;                                   // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_AchievementMissionSheet*       m_AchievementMissionSheet;                                // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_AchievementLevelSheet*         m_AchievementLevelSheet;                                  // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_AchievementPeriodSheet*        m_AchievementPeriodSheet;                                 // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_AchievementDefineSheet*        m_AchievementDefineSheet;                                 // 0x0048(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_AchievementCompareGroupSheet*  m_AchievementCompareGroupSheet;                           // 0x0050(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class CommonSource.AchievementTable");
		if (!ptr)
			ptr = UObject::FindClass("Class CommonSource.AchievementTable");
		return ptr;
	}

};


// Class CommonSource.AITable
// 0x0020 (0x0048 - 0x0028)
class UCommonSource_AITable : public UObject
{
public:
	class UCommonSource_AIParamSheet*                  m_AIParamSheet;                                           // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_AISkillSelectorSheet*          m_AISkillSelectorSheet;                                   // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_AIPatternSheet*                m_AIPatternSheet;                                         // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_AITreeSheet*                   m_AITreeSheet;                                            // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class CommonSource.AITable");
		if (!ptr)
			ptr = UObject::FindClass("Class CommonSource.AITable");
		return ptr;
	}

};


// Class CommonSource.AlchemyTable
// 0x0028 (0x0050 - 0x0028)
class UCommonSource_AlchemyTable : public UObject
{
public:
	class UCommonSource_AlchemyBoardInfoSheet*         m_AlchemyBoardInfoSheet;                                  // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_AlchemyInfoSheet*              m_AlchemyInfoSheet;                                       // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_AlchemyOptionCountSheet*       m_AlchemyOptionCountSheet;                                // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_AlchemyOptionSheet*            m_AlchemyOptionSheet;                                     // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_AlchemyDefineSheet*            m_AlchemyDefineSheet;                                     // 0x0048(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class CommonSource.AlchemyTable");
		if (!ptr)
			ptr = UObject::FindClass("Class CommonSource.AlchemyTable");
		return ptr;
	}

};


// Class CommonSource.AnimationTable
// 0x0008 (0x0030 - 0x0028)
class UCommonSource_AnimationTable : public UObject
{
public:
	class UCommonSource_AniInfoSheet*                  m_AniInfoSheet;                                           // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class CommonSource.AnimationTable");
		if (!ptr)
			ptr = UObject::FindClass("Class CommonSource.AnimationTable");
		return ptr;
	}

};


// Class CommonSource.AvatarTable
// 0x0048 (0x0070 - 0x0028)
class UCommonSource_AvatarTable : public UObject
{
public:
	class UCommonSource_AvatarInfoSheet*               m_AvatarInfoSheet;                                        // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_AvatarPoseSheet*               m_AvatarPoseSheet;                                        // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_AvatarPoseDefineSheet*         m_AvatarPoseDefineSheet;                                  // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_AvatarDialogueSheet*           m_AvatarDialogueSheet;                                    // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_AvatarGradeSheet*              m_AvatarGradeSheet;                                       // 0x0048(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_AvatarDefineSheet*             m_AvatarDefineSheet;                                      // 0x0050(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_AdvancementSheet*              m_AdvancementSheet;                                       // 0x0058(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_AvatarGaugeSheet*              m_AvatarGaugeSheet;                                       // 0x0060(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_AvatarStatuePoseSheet*         m_AvatarStatuePoseSheet;                                  // 0x0068(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class CommonSource.AvatarTable");
		if (!ptr)
			ptr = UObject::FindClass("Class CommonSource.AvatarTable");
		return ptr;
	}

};


// Class CommonSource.BalanceChangeTable
// 0x0020 (0x0048 - 0x0028)
class UCommonSource_BalanceChangeTable : public UObject
{
public:
	class UCommonSource_MapDataChangeSheet*            m_MapDataChangeSheet;                                     // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_RandomPackageChangeSheet*      m_RandomPackageChangeSheet;                               // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_MapDisplayCheckChangeSheet*    m_MapDisplayCheckChangeSheet;                             // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_DropExpGoldChangeSheet*        m_DropExpGoldChangeSheet;                                 // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class CommonSource.BalanceChangeTable");
		if (!ptr)
			ptr = UObject::FindClass("Class CommonSource.BalanceChangeTable");
		return ptr;
	}

};


// Class CommonSource.BlessingTable
// 0x0060 (0x0088 - 0x0028)
class UCommonSource_BlessingTable : public UObject
{
public:
	class UCommonSource_BlessingBoardInfoSheet*        m_BlessingBoardInfoSheet;                                 // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_CompleteParamInfoSheet*        m_CompleteParamInfoSheet;                                 // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_BlessingSlotInfoSheet*         m_BlessingSlotInfoSheet;                                  // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_BlessingStoneInfoSheet*        m_BlessingStoneInfoSheet;                                 // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_BlessingStoneGradeSheet*       m_BlessingStoneGradeSheet;                                // 0x0048(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_BlessingStoneOptionSheet*      m_BlessingStoneOptionSheet;                               // 0x0050(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_SymbolProbSheet*               m_SymbolProbSheet;                                        // 0x0058(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_BlessingSymbolCollectionSheet* m_BlessingSymbolCollectionSheet;                          // 0x0060(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_BlessingSlotEnchantSheet*      m_BlessingSlotEnchantSheet;                               // 0x0068(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_BlessingSlotEnchantOptionSheet* m_BlessingSlotEnchantOptionSheet;                         // 0x0070(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_BlessingBoardSampleSheet*      m_BlessingBoardSampleSheet;                               // 0x0078(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_BlessingDefineSheet*           m_BlessingDefineSheet;                                    // 0x0080(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class CommonSource.BlessingTable");
		if (!ptr)
			ptr = UObject::FindClass("Class CommonSource.BlessingTable");
		return ptr;
	}

};


// Class CommonSource.CashShopTable
// 0x0058 (0x0080 - 0x0028)
class UCommonSource_CashShopTable : public UObject
{
public:
	class UCommonSource_CashShopInfoSheet*             m_CashShopInfoSheet;                                      // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_CashShopLimitPackageSheet*     m_CashShopLimitPackageSheet;                              // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_CashShopDiscountInfoSheet*     m_CashShopDiscountInfoSheet;                              // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_GetItemListSheet*              m_GetItemListSheet;                                       // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_CashShopCategorySheet*         m_CashShopCategorySheet;                                  // 0x0048(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_CashShopDefineSheet*           m_CashShopDefineSheet;                                    // 0x0050(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_CashShopOdinPassPointSheet*    m_CashShopOdinPassPointSheet;                             // 0x0058(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_CashPurchaseMileageSheet*      m_CashPurchaseMileageSheet;                               // 0x0060(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_CashShopReplaceSheet*          m_CashShopReplaceSheet;                                   // 0x0068(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_RandomGuaranteeSheet*          m_RandomGuaranteeSheet;                                   // 0x0070(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_CashShopChainProductSheet*     m_CashShopChainProductSheet;                              // 0x0078(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class CommonSource.CashShopTable");
		if (!ptr)
			ptr = UObject::FindClass("Class CommonSource.CashShopTable");
		return ptr;
	}

};


// Class CommonSource.CastlewarTable
// 0x0080 (0x00A8 - 0x0028)
class UCommonSource_CastlewarTable : public UObject
{
public:
	class UCommonSource_CastleInfoSheet*               m_CastleInfoSheet;                                        // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_CastlewarDefineSheet*          m_CastlewarDefineSheet;                                   // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_MercenaryDefineSheet*          m_MercenaryDefineSheet;                                   // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_QualifierDefineSheet*          m_QualifierDefineSheet;                                   // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_CastlewarAreaBuffSheet*        m_CastlewarAreaBuffSheet;                                 // 0x0048(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_CastlewarRewardSheet*          m_CastlewarRewardSheet;                                   // 0x0050(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_CastlewarCostumeSheet*         m_CastlewarCostumeSheet;                                  // 0x0058(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_CastlewarBuffSheet*            m_CastlewarBuffSheet;                                     // 0x0060(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_CastlewarDistributionSheet*    m_CastlewarDistributionSheet;                             // 0x0068(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_CastlewarObjectSheet*          m_CastlewarObjectSheet;                                   // 0x0070(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_MercenaryRewardRateSheet*      m_MercenaryRewardRateSheet;                               // 0x0078(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_CastlewarDefenseBuffSheet*     m_CastlewarDefenseBuffSheet;                              // 0x0080(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_CastlewarGuildBuffSheet*       m_CastlewarGuildBuffSheet;                                // 0x0088(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_CastlewarObjectModifySheet*    m_CastlewarObjectModifySheet;                             // 0x0090(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_CastlewarGuildVehicleSheet*    m_CastlewarGuildVehicleSheet;                             // 0x0098(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_CastlewarDBSaveBuffIndexSheet* m_CastlewarDBSaveBuffIndexSheet;                          // 0x00A0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class CommonSource.CastlewarTable");
		if (!ptr)
			ptr = UObject::FindClass("Class CommonSource.CastlewarTable");
		return ptr;
	}

};


// Class CommonSource.ChatTable
// 0x0018 (0x0040 - 0x0028)
class UCommonSource_ChatTable : public UObject
{
public:
	class UCommonSource_GuildChatImotionSheet*         m_GuildChatImotionSheet;                                  // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ChatEmoticonSheet*             m_ChatEmoticonSheet;                                      // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ChatDefineSheet*               m_ChatDefineSheet;                                        // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class CommonSource.ChatTable");
		if (!ptr)
			ptr = UObject::FindClass("Class CommonSource.ChatTable");
		return ptr;
	}

};


// Class CommonSource.CinematicImgTextTable
// 0x0020 (0x0048 - 0x0028)
class UCommonSource_CinematicImgTextTable : public UObject
{
public:
	class UCommonSource_NameImgTextSheet*              m_NameImgTextSheet;                                       // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_NameIconTextSheet*             m_NameIconTextSheet;                                      // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_CinemaSubtitlesSheet*          m_CinemaSubtitlesSheet;                                   // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_CinemaInfoSheet*               m_CinemaInfoSheet;                                        // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class CommonSource.CinematicImgTextTable");
		if (!ptr)
			ptr = UObject::FindClass("Class CommonSource.CinematicImgTextTable");
		return ptr;
	}

};


// Class CommonSource.ClassChangeTable
// 0x0040 (0x0068 - 0x0028)
class UCommonSource_ClassChangeTable : public UObject
{
public:
	class UCommonSource_ClassChangeInfoSheet*          m_ClassChangeInfoSheet;                                   // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_SkillEnchantRewardSheet*       m_SkillEnchantRewardSheet;                                // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ChangeGradeSheet*              m_ChangeGradeSheet;                                       // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ChangeItemGradeSheet*          m_ChangeItemGradeSheet;                                   // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ItemChangePartsSheet*          m_ItemChangePartsSheet;                                   // 0x0048(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ClassChangePossiblePacketSheet* m_ClassChangePossiblePacketSheet;                         // 0x0050(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ClassChangeDefineSheet*        m_ClassChangeDefineSheet;                                 // 0x0058(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_SkillEnchantChangeGradeSheet*  m_SkillEnchantChangeGradeSheet;                           // 0x0060(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class CommonSource.ClassChangeTable");
		if (!ptr)
			ptr = UObject::FindClass("Class CommonSource.ClassChangeTable");
		return ptr;
	}

};


// Class CommonSource.CollectionTable
// 0x0020 (0x0048 - 0x0028)
class UCommonSource_CollectionTable : public UObject
{
public:
	class UCommonSource_CollectionRewardInfoSheet*     m_CollectionRewardInfoSheet;                              // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_CollectionCountTypeSheet*      m_CollectionCountTypeSheet;                               // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_CollectionReplaceSheet*        m_CollectionReplaceSheet;                                 // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_CollectionDefineSheet*         m_CollectionDefineSheet;                                  // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class CommonSource.CollectionTable");
		if (!ptr)
			ptr = UObject::FindClass("Class CommonSource.CollectionTable");
		return ptr;
	}

};


// Class CommonSource.CostumeTable
// 0x0020 (0x0048 - 0x0028)
class UCommonSource_CostumeTable : public UObject
{
public:
	class UCommonSource_CostumeInfoSheet*              m_CostumeInfoSheet;                                       // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_CostumePoseSheet*              m_CostumePoseSheet;                                       // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_CostumeDyeingColorSheet*       m_CostumeDyeingColorSheet;                                // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_CostumeDyeingDefineSheet*      m_CostumeDyeingDefineSheet;                               // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class CommonSource.CostumeTable");
		if (!ptr)
			ptr = UObject::FindClass("Class CommonSource.CostumeTable");
		return ptr;
	}

};


// Class CommonSource.CustomizingTable
// 0x0030 (0x0058 - 0x0028)
class UCommonSource_CustomizingTable : public UObject
{
public:
	class UCommonSource_CustomizingPresetSheet*        m_CustomizingPresetSheet;                                 // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_CustomizingTypeSheet*          m_CustomizingTypeSheet;                                   // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_CustomizingColorSheet*         m_CustomizingColorSheet;                                  // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_CustomizingGaugeSheet*         m_CustomizingGaugeSheet;                                  // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_CustomizingPoseSheet*          m_CustomizingPoseSheet;                                   // 0x0048(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_CustomizingCostumeSheet*       m_CustomizingCostumeSheet;                                // 0x0050(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class CommonSource.CustomizingTable");
		if (!ptr)
			ptr = UObject::FindClass("Class CommonSource.CustomizingTable");
		return ptr;
	}

};


// Class CommonSource.DialogueTable
// 0x0028 (0x0050 - 0x0028)
class UCommonSource_DialogueTable : public UObject
{
public:
	class UCommonSource_DialogueInfoSheet*             m_DialogueInfoSheet;                                      // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_MainTalkTypeSheet*             m_MainTalkTypeSheet;                                      // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_SubTalkTypeSheet*              m_SubTalkTypeSheet;                                       // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_DialogueDefineSheet*           m_DialogueDefineSheet;                                    // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_NPCRandomTalkSheet*            m_NPCRandomTalkSheet;                                     // 0x0048(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class CommonSource.DialogueTable");
		if (!ptr)
			ptr = UObject::FindClass("Class CommonSource.DialogueTable");
		return ptr;
	}

};


// Class CommonSource.EnumTable
// 0x0008 (0x0030 - 0x0028)
class UCommonSource_EnumTable : public UObject
{
public:
	class UCommonSource_EnumSheet*                     m_EnumSheet;                                              // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class CommonSource.EnumTable");
		if (!ptr)
			ptr = UObject::FindClass("Class CommonSource.EnumTable");
		return ptr;
	}

};


// Class CommonSource.EventTable
// 0x0008 (0x0030 - 0x0028)
class UCommonSource_EventTable : public UObject
{
public:
	class UCommonSource_EnchantGameSheet*              m_EnchantGameSheet;                                       // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class CommonSource.EventTable");
		if (!ptr)
			ptr = UObject::FindClass("Class CommonSource.EventTable");
		return ptr;
	}

};


// Class CommonSource.ExchangeTable
// 0x0030 (0x0058 - 0x0028)
class UCommonSource_ExchangeTable : public UObject
{
public:
	class UCommonSource_ExchangeCategorySheet*         m_ExchangeCategorySheet;                                  // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ExchangeSellingPriceSheet*     m_ExchangeSellingPriceSheet;                              // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ExchangeSortSheet*             m_ExchangeSortSheet;                                      // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ExchangeDefineSheet*           m_ExchangeDefineSheet;                                    // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ExchangeConditionCheckSheet*   m_ExchangeConditionCheckSheet;                            // 0x0048(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ExchangeEnchantAlertMultipleSheet* m_ExchangeEnchantAlertMultipleSheet;                      // 0x0050(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class CommonSource.ExchangeTable");
		if (!ptr)
			ptr = UObject::FindClass("Class CommonSource.ExchangeTable");
		return ptr;
	}

};


// Class CommonSource.GlobalDefineTable
// 0x0020 (0x0048 - 0x0028)
class UCommonSource_GlobalDefineTable : public UObject
{
public:
	class UCommonSource_DefineSheet*                   m_DefineSheet;                                            // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ResetTimeSheet*                m_ResetTimeSheet;                                         // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_WeekIntervalSheet*             m_WeekIntervalSheet;                                      // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_CoolTimeSheet*                 m_CoolTimeSheet;                                          // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class CommonSource.GlobalDefineTable");
		if (!ptr)
			ptr = UObject::FindClass("Class CommonSource.GlobalDefineTable");
		return ptr;
	}

};


// Class CommonSource.GuideTable
// 0x0010 (0x0038 - 0x0028)
class UCommonSource_GuideTable : public UObject
{
public:
	class UCommonSource_GuideSheet*                    m_GuideSheet;                                             // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_GachaOddsUrlSheet*             m_GachaOddsUrlSheet;                                      // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class CommonSource.GuideTable");
		if (!ptr)
			ptr = UObject::FindClass("Class CommonSource.GuideTable");
		return ptr;
	}

};


// Class CommonSource.GuildBattlefieldTable
// 0x0040 (0x0068 - 0x0028)
class UCommonSource_GuildBattlefieldTable : public UObject
{
public:
	class UCommonSource_GuildBattlefieldObjectDefineSheet* m_GuildBattlefieldObjectDefineSheet;                      // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_GuildBattlefieldSpawnGroupSheet* m_GuildBattlefieldSpawnGroupSheet;                        // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_GuildBattlefieldMonsterGroupSheet* m_GuildBattlefieldMonsterGroupSheet;                      // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_GuildBattlefieldDoubleMonsterSheet* m_GuildBattlefieldDoubleMonsterSheet;                     // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_GuildBattlefieldMatchingGroupSheet* m_GuildBattlefieldMatchingGroupSheet;                     // 0x0048(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_GuildBattlefieldTimeDefineSheet* m_GuildBattlefieldTimeDefineSheet;                        // 0x0050(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_GuildBattlefieldBattleTimeSheet* m_GuildBattlefieldBattleTimeSheet;                        // 0x0058(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_GuildBattlefieldDefineSheet*   m_GuildBattlefieldDefineSheet;                            // 0x0060(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class CommonSource.GuildBattlefieldTable");
		if (!ptr)
			ptr = UObject::FindClass("Class CommonSource.GuildBattlefieldTable");
		return ptr;
	}

};


// Class CommonSource.GuildDefenseTable
// 0x0060 (0x0088 - 0x0028)
class UCommonSource_GuildDefenseTable : public UObject
{
public:
	class UCommonSource_DefenseWaveInfoSheet*          m_DefenseWaveInfoSheet;                                   // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_StatueInfoSheet*               m_StatueInfoSheet;                                        // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_VehicleSummonPointInfoSheet*   m_VehicleSummonPointInfoSheet;                            // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_DefenseSummonMonsterSheet*     m_DefenseSummonMonsterSheet;                              // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_DefenseSummonMonsterAreaInfoSheet* m_DefenseSummonMonsterAreaInfoSheet;                      // 0x0048(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ChaseWayPointSheet*            m_ChaseWayPointSheet;                                     // 0x0050(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_DefenseSummonVehicleSheet*     m_DefenseSummonVehicleSheet;                              // 0x0058(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_StatueBlessInfoSheet*          m_StatueBlessInfoSheet;                                   // 0x0060(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_DropGuardianCoinSheet*         m_DropGuardianCoinSheet;                                  // 0x0068(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_SupplementGuardianCoinSheet*   m_SupplementGuardianCoinSheet;                            // 0x0070(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_DefenseGuideInfoSheet*         m_DefenseGuideInfoSheet;                                  // 0x0078(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_GuildDefenseDefineSheet*       m_GuildDefenseDefineSheet;                                // 0x0080(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class CommonSource.GuildDefenseTable");
		if (!ptr)
			ptr = UObject::FindClass("Class CommonSource.GuildDefenseTable");
		return ptr;
	}

};


// Class CommonSource.GuildItemMakeTable
// 0x0030 (0x0058 - 0x0028)
class UCommonSource_GuildItemMakeTable : public UObject
{
public:
	class UCommonSource_GuildItemMakeDefineSheet*      m_GuildItemMakeDefineSheet;                               // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_GuildItemMakeSlotSheet*        m_GuildItemMakeSlotSheet;                                 // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_GuildItemMakeInfoSheet*        m_GuildItemMakeInfoSheet;                                 // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_GuildItemMakeCategorySheet*    m_GuildItemMakeCategorySheet;                             // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_GuildItemMakeMaterialRewardSheet* m_GuildItemMakeMaterialRewardSheet;                       // 0x0048(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_GuildItemMakeRedDotSheet*      m_GuildItemMakeRedDotSheet;                               // 0x0050(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class CommonSource.GuildItemMakeTable");
		if (!ptr)
			ptr = UObject::FindClass("Class CommonSource.GuildItemMakeTable");
		return ptr;
	}

};


// Class CommonSource.GuildRaidTable
// 0x0020 (0x0048 - 0x0028)
class UCommonSource_GuildRaidTable : public UObject
{
public:
	class UCommonSource_RaidInfoSheet*                 m_RaidInfoSheet;                                          // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_RaidBuffSheet*                 m_RaidBuffSheet;                                          // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_RaidSkillPrioritySheet*        m_RaidSkillPrioritySheet;                                 // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_GuildRaidDefineSheet*          m_GuildRaidDefineSheet;                                   // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class CommonSource.GuildRaidTable");
		if (!ptr)
			ptr = UObject::FindClass("Class CommonSource.GuildRaidTable");
		return ptr;
	}

};


// Class CommonSource.GuildStrongholdTable
// 0x0040 (0x0068 - 0x0028)
class UCommonSource_GuildStrongholdTable : public UObject
{
public:
	class UCommonSource_StrongholdDefineSheet*         m_StrongholdDefineSheet;                                  // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_StrongholdInfoSheet*           m_StrongholdInfoSheet;                                    // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_StrongholdBuffSheet*           m_StrongholdBuffSheet;                                    // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_StrongholdBuffGroupSheet*      m_StrongholdBuffGroupSheet;                               // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_StrongholdBuffGroupSetSheet*   m_StrongholdBuffGroupSetSheet;                            // 0x0048(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_StrongholdBuffGroupSetPoolSheet* m_StrongholdBuffGroupSetPoolSheet;                        // 0x0050(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_StrongholdNotiSheet*           m_StrongholdNotiSheet;                                    // 0x0058(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_StrongholdRankingSheet*        m_StrongholdRankingSheet;                                 // 0x0060(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class CommonSource.GuildStrongholdTable");
		if (!ptr)
			ptr = UObject::FindClass("Class CommonSource.GuildStrongholdTable");
		return ptr;
	}

};


// Class CommonSource.GuildTable
// 0x0068 (0x0090 - 0x0028)
class UCommonSource_GuildTable : public UObject
{
public:
	class UCommonSource_GuildLevelSheet*               m_GuildLevelSheet;                                        // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_GuildJobSheet*                 m_GuildJobSheet;                                          // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_GuildTendencySheet*            m_GuildTendencySheet;                                     // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_GuildMarkSheet*                m_GuildMarkSheet;                                         // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_GuildMarkFrameColorSheet*      m_GuildMarkFrameColorSheet;                               // 0x0048(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_GuildMarkBackgroundColorSheet* m_GuildMarkBackgroundColorSheet;                          // 0x0050(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_GuildMarkEffectSheet*          m_GuildMarkEffectSheet;                                   // 0x0058(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_GuildDonateSheet*              m_GuildDonateSheet;                                       // 0x0060(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_GuildDefineSheet*              m_GuildDefineSheet;                                       // 0x0068(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_GuildAllianceDefineSheet*      m_GuildAllianceDefineSheet;                               // 0x0070(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_GuildAuctionDefineSheet*       m_GuildAuctionDefineSheet;                                // 0x0078(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_GuildAuctionMonsterSheet*      m_GuildAuctionMonsterSheet;                               // 0x0080(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_GuildOpenChattingSheet*        m_GuildOpenChattingSheet;                                 // 0x0088(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class CommonSource.GuildTable");
		if (!ptr)
			ptr = UObject::FindClass("Class CommonSource.GuildTable");
		return ptr;
	}

};


// Class CommonSource.ImprintTable
// 0x0040 (0x0068 - 0x0028)
class UCommonSource_ImprintTable : public UObject
{
public:
	class UCommonSource_ImprintStepSheet*              m_ImprintStepSheet;                                       // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ImprintOptionSheet*            m_ImprintOptionSheet;                                     // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ImprintDefineSheet*            m_ImprintDefineSheet;                                     // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ImprintIconSheet*              m_ImprintIconSheet;                                       // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_SpecializeStepSheet*           m_SpecializeStepSheet;                                    // 0x0048(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_SpecializeOptionSheet*         m_SpecializeOptionSheet;                                  // 0x0050(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_SpecializeDefineSheet*         m_SpecializeDefineSheet;                                  // 0x0058(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_SpecializeIconSheet*           m_SpecializeIconSheet;                                    // 0x0060(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class CommonSource.ImprintTable");
		if (!ptr)
			ptr = UObject::FindClass("Class CommonSource.ImprintTable");
		return ptr;
	}

};


// Class CommonSource.InfinityDungeonTable
// 0x0060 (0x0088 - 0x0028)
class UCommonSource_InfinityDungeonTable : public UObject
{
public:
	class UCommonSource_InfinityDungeonAreaInfoSheet*  m_InfinityDungeonAreaInfoSheet;                           // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_InfinityDungeonFloorInfoSheet* m_InfinityDungeonFloorInfoSheet;                          // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_InfinityDungeonSeasonRewardSheet* m_InfinityDungeonSeasonRewardSheet;                       // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_InfinityDungeonBuffSheet*      m_InfinityDungeonBuffSheet;                               // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_InfinityDungeonSkillPrioritySheet* m_InfinityDungeonSkillPrioritySheet;                      // 0x0048(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_InfinityDungeonSettingSheet*   m_InfinityDungeonSettingSheet;                            // 0x0050(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_InfinityDungeonBattleTypeSheet* m_InfinityDungeonBattleTypeSheet;                         // 0x0058(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_InfinityDungeonMultiBossSettingSheet* m_InfinityDungeonMultiBossSettingSheet;                   // 0x0060(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_InfinityDungeonSummonSheet*    m_InfinityDungeonSummonSheet;                             // 0x0068(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_InfinityDungeonBalanceSheet*   m_InfinityDungeonBalanceSheet;                            // 0x0070(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_InfinityDungeonDefineSheet*    m_InfinityDungeonDefineSheet;                             // 0x0078(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_InfinityDungeonWeakenDefineSheet* m_InfinityDungeonWeakenDefineSheet;                       // 0x0080(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class CommonSource.InfinityDungeonTable");
		if (!ptr)
			ptr = UObject::FindClass("Class CommonSource.InfinityDungeonTable");
		return ptr;
	}

};


// Class CommonSource.InputLimitTable
// 0x0008 (0x0030 - 0x0028)
class UCommonSource_InputLimitTable : public UObject
{
public:
	class UCommonSource_InputLimitDefineSheet*         m_InputLimitDefineSheet;                                  // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class CommonSource.InputLimitTable");
		if (!ptr)
			ptr = UObject::FindClass("Class CommonSource.InputLimitTable");
		return ptr;
	}

};


// Class CommonSource.InteractTable
// 0x0020 (0x0048 - 0x0028)
class UCommonSource_InteractTable : public UObject
{
public:
	class UCommonSource_InteractSheet*                 m_InteractSheet;                                          // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_InteractTypeInfoSheet*         m_InteractTypeInfoSheet;                                  // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_InteractValidationDistanceSheet* m_InteractValidationDistanceSheet;                        // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_AutoGatherInfoSheet*           m_AutoGatherInfoSheet;                                    // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class CommonSource.InteractTable");
		if (!ptr)
			ptr = UObject::FindClass("Class CommonSource.InteractTable");
		return ptr;
	}

};


// Class CommonSource.InternationalizationTable
// 0x0020 (0x0048 - 0x0028)
class UCommonSource_InternationalizationTable : public UObject
{
public:
	class UCommonSource_CultureOptionSheet*            m_CultureOptionSheet;                                     // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_CultureDLCBlockSheet*          m_CultureDLCBlockSheet;                                   // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_RegionOptionSheet*             m_RegionOptionSheet;                                      // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_StringTagInfoSheet*            m_StringTagInfoSheet;                                     // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class CommonSource.InternationalizationTable");
		if (!ptr)
			ptr = UObject::FindClass("Class CommonSource.InternationalizationTable");
		return ptr;
	}

};


// Class CommonSource.ItemTable
// 0x00E8 (0x0110 - 0x0028)
class UCommonSource_ItemTable : public UObject
{
public:
	class UCommonSource_ItemInfoSheet*                 m_ItemInfoSheet;                                          // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ItemEnchantSheet*              m_ItemEnchantSheet;                                       // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ItemEnchantMaterialSheet*      m_ItemEnchantMaterialSheet;                               // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ItemWorkmanshipCostSheet*      m_ItemWorkmanshipCostSheet;                               // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ItemWorkmanshipSheet*          m_ItemWorkmanshipSheet;                                   // 0x0048(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ItemRandomOptionSheet*         m_ItemRandomOptionSheet;                                  // 0x0050(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ItemSoulEnchantSheet*          m_ItemSoulEnchantSheet;                                   // 0x0058(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ItemSoulEffectSheet*           m_ItemSoulEffectSheet;                                    // 0x0060(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ItemBindSheet*                 m_ItemBindSheet;                                          // 0x0068(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ItemGradeInfoSheet*            m_ItemGradeInfoSheet;                                     // 0x0070(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ItemDefineSheet*               m_ItemDefineSheet;                                        // 0x0078(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_PetInfoSheet*                  m_PetInfoSheet;                                           // 0x0080(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_PetRandomOptionSheet*          m_PetRandomOptionSheet;                                   // 0x0088(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_PetRandomOptionInfoSheet*      m_PetRandomOptionInfoSheet;                               // 0x0090(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ItemSlotSheet*                 m_ItemSlotSheet;                                          // 0x0098(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ItemMakeSheet*                 m_ItemMakeSheet;                                          // 0x00A0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ItemMakeCategorySheet*         m_ItemMakeCategorySheet;                                  // 0x00A8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ItemRecoveryCategorySheet*     m_ItemRecoveryCategorySheet;                              // 0x00B0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ItemMakeReplaceSheet*          m_ItemMakeReplaceSheet;                                   // 0x00B8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ItemDismantleSheet*            m_ItemDismantleSheet;                                     // 0x00C0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ItemSetSheet*                  m_ItemSetSheet;                                           // 0x00C8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ItemConsumeSheet*              m_ItemConsumeSheet;                                       // 0x00D0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ItemEquipSlotSheet*            m_ItemEquipSlotSheet;                                     // 0x00D8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ItemUseLimitSheet*             m_ItemUseLimitSheet;                                      // 0x00E0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ItemDropControlSheet*          m_ItemDropControlSheet;                                   // 0x00E8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_DropControlGroupSheet*         m_DropControlGroupSheet;                                  // 0x00F0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_DropControlServerGroupSheet*   m_DropControlServerGroupSheet;                            // 0x00F8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ItemSourceSheet*               m_ItemSourceSheet;                                        // 0x0100(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ItemReplacementSheet*          m_ItemReplacementSheet;                                   // 0x0108(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class CommonSource.ItemTable");
		if (!ptr)
			ptr = UObject::FindClass("Class CommonSource.ItemTable");
		return ptr;
	}

};


// Class CommonSource.KakaoIndicatorTable
// 0x0020 (0x0048 - 0x0028)
class UCommonSource_KakaoIndicatorTable : public UObject
{
public:
	class UCommonSource_ResourceIndicatorSheet*        m_ResourceIndicatorSheet;                                 // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ItemIndicatorSheet*            m_ItemIndicatorSheet;                                     // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_ResourceTypeSheet*             m_ResourceTypeSheet;                                      // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_IndicatorItemTypeSheet*        m_IndicatorItemTypeSheet;                                 // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class CommonSource.KakaoIndicatorTable");
		if (!ptr)
			ptr = UObject::FindClass("Class CommonSource.KakaoIndicatorTable");
		return ptr;
	}

};


// Class CommonSource.LinkTable
// 0x0048 (0x0070 - 0x0028)
class UCommonSource_LinkTable : public UObject
{
public:
	class UCommonSource_LinkBoardInfoSheet*            m_LinkBoardInfoSheet;                                     // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_LinkSlotInfoSheet*             m_LinkSlotInfoSheet;                                      // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_LinkEmblemInfoSheet*           m_LinkEmblemInfoSheet;                                    // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCommonSource_LinkEmblemOptionSheet*         m_LinkEmblemOptionSheet;                                  // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
