#pragma once

// Name: , Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x1)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class Engine.DeveloperSettings
// 0x0010 (0x0038 - 0x0028)
class UEngine_DeveloperSettings : public UObject
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0028(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.DeveloperSettings");
		if (!ptr)
			ptr = UObject::FindClass("Class Engine.DeveloperSettings");
		return ptr;
	}

};


// Class Engine.Actor
// 0x01F0 (0x0218 - 0x0028)
class AEngine_Actor : public UObject
{
public:
	struct FEngine_ActorTickFunction                   PrimaryActorTick;                                         // 0x0028(0x0030) (Edit, DisableEditOnInstance)
	unsigned char                                      bHidden : 1;                                              // 0x0058(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, Net)
	unsigned char                                      bNetTemporary : 1;                                        // 0x0058(0x0001)
	unsigned char                                      bNetStartup : 1;                                          // 0x0058(0x0001)
	unsigned char                                      bOnlyRelevantToOwner : 1;                                 // 0x0058(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	unsigned char                                      bAlwaysRelevant : 1;                                      // 0x0058(0x0001) (Edit, BlueprintVisible, DisableEditOnInstance)
	unsigned char                                      bReplicateMovement : 1;                                   // 0x0058(0x0001) (Edit, Net, DisableEditOnInstance)
	unsigned char                                      bTearOff : 1;                                             // 0x0058(0x0001) (Net)
	unsigned char                                      bExchangedRoles : 1;                                      // 0x0058(0x0001) (Transient)
	unsigned char                                      bNetLoadOnClient : 1;                                     // 0x0059(0x0001) (Edit)
	unsigned char                                      bNetUseOwnerRelevancy : 1;                                // 0x0059(0x0001) (Edit, BlueprintVisible, DisableEditOnInstance)
	unsigned char                                      bRelevantForNetworkReplays : 1;                           // 0x0059(0x0001)
	unsigned char                                      bRelevantForLevelBounds : 1;                              // 0x0059(0x0001) (Edit)
	unsigned char                                      bReplayRewindable : 1;                                    // 0x0059(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bAllowTickBeforeBeginPlay : 1;                            // 0x0059(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bAutoDestroyWhenFinished : 1;                             // 0x0059(0x0001) (BlueprintVisible)
	unsigned char                                      bBlockInput : 1;                                          // 0x0059(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bCanBeDamaged : 1;                                        // 0x005A(0x0001) (Edit, BlueprintVisible, Net, SaveGame)
	unsigned char                                      bCollideWhenPlacing : 1;                                  // 0x005A(0x0001)
	unsigned char                                      bFindCameraComponentWhenViewTarget : 1;                   // 0x005A(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bGenerateOverlapEventsDuringLevelStreaming : 1;           // 0x005A(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bIgnoresOriginShifting : 1;                               // 0x005A(0x0001) (Edit)
	unsigned char                                      bEnableAutoLODGeneration : 1;                             // 0x005A(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bIsEditorOnlyActor : 1;                                   // 0x005A(0x0001) (Edit)
	unsigned char                                      bActorSeamlessTraveled : 1;                               // 0x005A(0x0001)
	unsigned char                                      bReplicates : 1;                                          // 0x005B(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	unsigned char                                      bCanBeInCluster : 1;                                      // 0x005B(0x0001) (Edit)
	unsigned char                                      bAllowReceiveTickEventOnDedicatedServer : 1;              // 0x005B(0x0001)
	unsigned char                                      UnknownData00 : 5;                                        // 0x005B(0x0001)
	unsigned char                                      UnknownData01 : 2;                                        // 0x005C(0x0001)
	unsigned char                                      bActorEnableCollision : 1;                                // 0x005C(0x0001)
	unsigned char                                      bActorIsBeingDestroyed : 1;                               // 0x005C(0x0001) (Transient, DuplicateTransient)
	FEngine_Engine_EActorUpdateOverlapsMethod          UpdateOverlapsMethodDuringLevelStreaming;                 // 0x005D(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	FEngine_Engine_EActorUpdateOverlapsMethod          DefaultUpdateOverlapsMethodDuringLevelStreaming;          // 0x005E(0x0001) (Edit, ZeroConstructor, Config, EditConst, IsPlainOldData)
	TEnumAsByte<FEngine_Engine_ENetRole>               RemoteRole;                                               // 0x005F(0x0001) (Net, ZeroConstructor, Transient, IsPlainOldData)
	struct FEngine_RepMovement                         ReplicatedMovement;                                       // 0x0060(0x0034) (Edit, Net, DisableEditOnInstance)
	float                                              InitialLifeSpan;                                          // 0x0094(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              CustomTimeDilation;                                       // 0x0098(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x009C(0x0004) MISSED OFFSET
	struct FEngine_RepAttachment                       AttachmentReplication;                                    // 0x00A0(0x0040) (Net, Transient)
	class AEngine_Actor*                               Owner;                                                    // 0x00E0(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	struct FName                                       NetDriverName;                                            // 0x00E8(0x0008) (ZeroConstructor, IsPlainOldData)
	TEnumAsByte<FEngine_Engine_ENetRole>               Role;                                                     // 0x00F0(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<FEngine_Engine_ENetDormancy>           NetDormancy;                                              // 0x00F1(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	FEngine_Engine_ESpawnActorCollisionHandlingMethod  SpawnCollisionHandlingMethod;                             // 0x00F2(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<FEngine_Engine_EAutoReceiveInput>      AutoReceiveInput;                                         // 0x00F3(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                InputPriority;                                            // 0x00F4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	class UEngine_InputComponent*                      InputComponent;                                           // 0x00F8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, DuplicateTransient, IsPlainOldData)
	float                                              NetCullDistanceSquared;                                   // 0x0100(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                NetTag;                                                   // 0x0104(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              NetUpdateFrequency;                                       // 0x0108(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MinNetUpdateFrequency;                                    // 0x010C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              NetPriority;                                              // 0x0110(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x0114(0x0004) MISSED OFFSET
	class AEngine_Pawn*                                Instigator;                                               // 0x0118(0x0008) (BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	TArray<class AEngine_Actor*>                       Children;                                                 // 0x0120(0x0010) (ZeroConstructor, Transient)
	class UEngine_SceneComponent*                      RootComponent;                                            // 0x0130(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	TArray<class AEngine_MatineeActor*>                ControllingMatineeActors;                                 // 0x0138(0x0010) (ZeroConstructor, Transient)
	unsigned char                                      UnknownData04[0x8];                                       // 0x0148(0x0008) MISSED OFFSET
	TArray<struct FName>                               Layers;                                                   // 0x0150(0x0010) (ZeroConstructor)
	TWeakObjectPtr<class UEngine_ChildActorComponent>  ParentComponent;                                          // 0x0160(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	TArray<struct FName>                               Tags;                                                     // 0x0168(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	unsigned char                                      OnTakeAnyDamage;                                          // 0x0178(0x0001) (InstancedReference, BlueprintAssignable)
	unsigned char                                      OnTakePointDamage;                                        // 0x0179(0x0001) (InstancedReference, BlueprintAssignable)
	unsigned char                                      OnTakeRadialDamage;                                       // 0x017A(0x0001) (InstancedReference, BlueprintAssignable)
	unsigned char                                      OnActorBeginOverlap;                                      // 0x017B(0x0001) (InstancedReference, BlueprintAssignable)
	unsigned char                                      OnActorEndOverlap;                                        // 0x017C(0x0001) (InstancedReference, BlueprintAssignable)
	unsigned char                                      OnBeginCursorOver;                                        // 0x017D(0x0001) (InstancedReference, BlueprintAssignable)
	unsigned char                                      OnEndCursorOver;                                          // 0x017E(0x0001) (InstancedReference, BlueprintAssignable)
	unsigned char                                      OnClicked;                                                // 0x017F(0x0001) (InstancedReference, BlueprintAssignable)
	unsigned char                                      OnReleased;                                               // 0x0180(0x0001) (InstancedReference, BlueprintAssignable)
	unsigned char                                      OnInputTouchBegin;                                        // 0x0181(0x0001) (InstancedReference, BlueprintAssignable)
	unsigned char                                      OnInputTouchEnd;                                          // 0x0182(0x0001) (InstancedReference, BlueprintAssignable)
	unsigned char                                      OnInputTouchEnter;                                        // 0x0183(0x0001) (InstancedReference, BlueprintAssignable)
	unsigned char                                      OnInputTouchLeave;                                        // 0x0184(0x0001) (InstancedReference, BlueprintAssignable)
	unsigned char                                      OnActorHit;                                               // 0x0185(0x0001) (InstancedReference, BlueprintAssignable)
	unsigned char                                      OnDestroyed;                                              // 0x0186(0x0001) (InstancedReference, BlueprintAssignable)
	unsigned char                                      OnEndPlay;                                                // 0x0187(0x0001) (InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData05[0x60];                                      // 0x0188(0x0060) MISSED OFFSET
	TArray<class UEngine_ActorComponent*>              InstanceComponents;                                       // 0x01E8(0x0010) (ExportObject, ZeroConstructor)
	TArray<class UEngine_ActorComponent*>              BlueprintCreatedComponents;                               // 0x01F8(0x0010) (ExportObject, ZeroConstructor)
	unsigned char                                      UnknownData06[0x10];                                      // 0x0208(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.Actor");
		if (!ptr)
			ptr = UObject::FindClass("Class Engine.Actor");
		return ptr;
	}


	bool WasRecentlyRendered(float Tolerance);
	void UserConstructionScript();
	void TearOff();
	void SnapRootComponentTo(class AEngine_Actor* InParentActor, const struct FName& InSocketName);
	void SetTickGroup(TEnumAsByte<FEngine_Engine_ETickingGroup> NewTickGroup);
	void SetTickableWhenPaused(bool bTickableWhenPaused);
	void SetReplicates(bool bInReplicates);
	void SetReplicateMovement(bool bInReplicateMovement);
	void SetOwner(class AEngine_Actor* NewOwner);
	void SetNetDormancy(TEnumAsByte<FEngine_Engine_ENetDormancy> NewDormancy);
	void SetLifeSpan(float InLifespan);
	void SetActorTickInterval(float TickInterval);
	void SetActorTickEnabled(bool bEnabled);
	void SetActorScale3D(const struct FVector& NewScale3D);
	void SetActorRelativeScale3D(const struct FVector& NewRelativeScale);
	void SetActorHiddenInGame(bool bNewHidden);
	void SetActorEnableCollision(bool bNewActorEnableCollision);
	void RemoveTickPrerequisiteComponent(class UEngine_ActorComponent* PrerequisiteComponent);
	void RemoveTickPrerequisiteActor(class AEngine_Actor* PrerequisiteActor);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveRadialDamage(float DamageReceived, class UEngine_DamageType* DamageType, const struct FVector& Origin, const struct FEngine_HitResult& HitInfo, class AEngine_Controller* InstigatedBy, class AEngine_Actor* DamageCauser);
	void ReceivePointDamage(float Damage, class UEngine_DamageType* DamageType, const struct FVector& HitLocation, const struct FVector& HitNormal, class UEngine_PrimitiveComponent* HitComponent, const struct FName& BoneName, const struct FVector& ShotFromDirection, class AEngine_Controller* InstigatedBy, class AEngine_Actor* DamageCauser, const struct FEngine_HitResult& HitInfo);
	void ReceiveHit(class UEngine_PrimitiveComponent* MyComp, class AEngine_Actor* Other, class UEngine_PrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FEngine_HitResult& Hit);
	void ReceiveEndPlay(TEnumAsByte<FEngine_Engine_EEndPlayReason> EndPlayReason);
	void ReceiveDestroyed();
	void ReceiveBeginPlay();
	void ReceiveAnyDamage(float Damage, class UEngine_DamageType* DamageType, class AEngine_Controller* InstigatedBy, class AEngine_Actor* DamageCauser);
	void ReceiveActorOnReleased(const struct FInputCore_Key& ButtonReleased);
	void ReceiveActorOnInputTouchLeave(TEnumAsByte<FInputCore_InputCore_ETouchIndex> FingerIndex);
	void ReceiveActorOnInputTouchEnter(TEnumAsByte<FInputCore_InputCore_ETouchIndex> FingerIndex);
	void ReceiveActorOnInputTouchEnd(TEnumAsByte<FInputCore_InputCore_ETouchIndex> FingerIndex);
	void ReceiveActorOnInputTouchBegin(TEnumAsByte<FInputCore_InputCore_ETouchIndex> FingerIndex);
	void ReceiveActorOnClicked(const struct FInputCore_Key& ButtonPressed);
	void ReceiveActorEndOverlap(class AEngine_Actor* OtherActor);
	void ReceiveActorEndCursorOver();
	void ReceiveActorBeginOverlap(class AEngine_Actor* OtherActor);
	void ReceiveActorBeginCursorOver();
	void PrestreamTextures(float Seconds, bool bEnableStreaming, int CinematicTextureGroups);
	void OnRep_ReplicateMovement();
	void OnRep_ReplicatedMovement();
	void OnRep_Owner();
	void OnRep_Instigator();
	void OnRep_AttachmentReplication();
	void MakeNoise(float Loudness, class AEngine_Pawn* NoiseInstigator, const struct FVector& NoiseLocation, float MaxRange, const struct FName& Tag);
	class UEngine_MaterialInstanceDynamic* MakeMIDForMaterial(class UEngine_MaterialInterface* Parent);
	bool K2_TeleportTo(const struct FVector& DestLocation, const struct FRotator& DestRotation);
	bool K2_SetActorTransform(const struct FTransform& NewTransform, bool bSweep, bool bTeleport, struct FEngine_HitResult* SweepHitResult);
	bool K2_SetActorRotation(const struct FRotator& NewRotation, bool bTeleportPhysics);
	void K2_SetActorRelativeTransform(const struct FTransform& NewRelativeTransform, bool bSweep, bool bTeleport, struct FEngine_HitResult* SweepHitResult);
	void K2_SetActorRelativeRotation(const struct FRotator& NewRelativeRotation, bool bSweep, bool bTeleport, struct FEngine_HitResult* SweepHitResult);
	void K2_SetActorRelativeLocation(const struct FVector& NewRelativeLocation, bool bSweep, bool bTeleport, struct FEngine_HitResult* SweepHitResult);
	bool K2_SetActorLocationAndRotation(const struct FVector& NewLocation, const struct FRotator& NewRotation, bool bSweep, bool bTeleport, struct FEngine_HitResult* SweepHitResult);
	bool K2_SetActorLocation(const struct FVector& NewLocation, bool bSweep, bool bTeleport, struct FEngine_HitResult* SweepHitResult);
	void K2_OnReset();
	void K2_OnEndViewTarget(class AEngine_PlayerController* PC);
	void K2_OnBecomeViewTarget(class AEngine_PlayerController* PC);
	class UEngine_SceneComponent* K2_GetRootComponent();
	TArray<class UEngine_ActorComponent*> K2_GetComponentsByClass(class UClass* ComponentClass);
	struct FRotator K2_GetActorRotation();
	struct FVector K2_GetActorLocation();
	void K2_DetachFromActor(FEngine_Engine_EDetachmentRule LocationRule, FEngine_Engine_EDetachmentRule RotationRule, FEngine_Engine_EDetachmentRule ScaleRule);
	void K2_DestroyComponent(class UEngine_ActorComponent* Component);
	void K2_DestroyActor();
	void K2_AttachToComponent(class UEngine_SceneComponent* Parent, const struct FName& SocketName, FEngine_Engine_EAttachmentRule LocationRule, FEngine_Engine_EAttachmentRule RotationRule, FEngine_Engine_EAttachmentRule ScaleRule, bool bWeldSimulatedBodies);
	void K2_AttachToActor(class AEngine_Actor* ParentActor, const struct FName& SocketName, FEngine_Engine_EAttachmentRule LocationRule, FEngine_Engine_EAttachmentRule RotationRule, FEngine_Engine_EAttachmentRule ScaleRule, bool bWeldSimulatedBodies);
	void K2_AttachRootComponentToActor(class AEngine_Actor* InParentActor, const struct FName& InSocketName, TEnumAsByte<FEngine_Engine_EAttachLocation> AttachLocationType, bool bWeldSimulatedBodies);
	void K2_AttachRootComponentTo(class UEngine_SceneComponent* InParent, const struct FName& InSocketName, TEnumAsByte<FEngine_Engine_EAttachLocation> AttachLocationType, bool bWeldSimulatedBodies);
	void K2_AddActorWorldTransform(const struct FTransform& DeltaTransform, bool bSweep, bool bTeleport, struct FEngine_HitResult* SweepHitResult);
	void K2_AddActorWorldRotation(const struct FRotator& DeltaRotation, bool bSweep, bool bTeleport, struct FEngine_HitResult* SweepHitResult);
	void K2_AddActorWorldOffset(const struct FVector& DeltaLocation, bool bSweep, bool bTeleport, struct FEngine_HitResult* SweepHitResult);
	void K2_AddActorLocalTransform(const struct FTransform& NewTransform, bool bSweep, bool bTeleport, struct FEngine_HitResult* SweepHitResult);
	void K2_AddActorLocalRotation(const struct FRotator& DeltaRotation, bool bSweep, bool bTeleport, struct FEngine_HitResult* SweepHitResult);
	void K2_AddActorLocalOffset(const struct FVector& DeltaLocation, bool bSweep, bool bTeleport, struct FEngine_HitResult* SweepHitResult);
	bool IsOverlappingActor(class AEngine_Actor* Other);
	bool IsChildActor();
	bool IsActorTickEnabled();
	bool IsActorBeingDestroyed();
	bool HasAuthority();
	float GetVerticalDistanceTo(class AEngine_Actor* OtherActor);
	struct FVector GetVelocity();
	struct FTransform GetTransform();
	bool GetTickableWhenPaused();
	float GetSquaredDistanceTo(class AEngine_Actor* OtherActor);
	TEnumAsByte<FEngine_Engine_ENetRole> GetRemoteRole();
	class UEngine_ChildActorComponent* GetParentComponent();
	class AEngine_Actor* GetParentActor();
	class AEngine_Actor* GetOwner();
	void GetOverlappingComponents(TArray<class UEngine_PrimitiveComponent*>* OverlappingComponents);
	void GetOverlappingActors(class UClass* ClassFilter, TArray<class AEngine_Actor*>* OverlappingActors);
	TEnumAsByte<FEngine_Engine_ENetRole> GetLocalRole();
	float GetLifeSpan();
	class AEngine_Controller* GetInstigatorController();
	class AEngine_Pawn* GetInstigator();
	struct FVector GetInputVectorAxisValue(const struct FInputCore_Key& InputAxisKey);
	float GetInputAxisValue(const struct FName& InputAxisName);
	float GetInputAxisKeyValue(const struct FInputCore_Key& InputAxisKey);
	float GetHorizontalDotProductTo(class AEngine_Actor* OtherActor);
	float GetHorizontalDistanceTo(class AEngine_Actor* OtherActor);
	float GetGameTimeSinceCreation();
	float GetDotProductTo(class AEngine_Actor* OtherActor);
	float GetDistanceTo(class AEngine_Actor* OtherActor);
	TArray<class UEngine_ActorComponent*> GetComponentsByTag(class UClass* ComponentClass, const struct FName& Tag);
	TArray<class UEngine_ActorComponent*> GetComponentsByInterface(class UClass* Interface);
	class UEngine_ActorComponent* GetComponentByClass(class UClass* ComponentClass);
	struct FName GetAttachParentSocketName();
	class AEngine_Actor* GetAttachParentActor();
	void GetAttachedActors(bool bResetArray, TArray<class AEngine_Actor*>* OutActors);
	void GetAllChildActors(bool bIncludeDescendants, TArray<class AEngine_Actor*>* ChildActors);
	struct FVector GetActorUpVector();
	float GetActorTimeDilation();
	float GetActorTickInterval();
	struct FVector GetActorScale3D();
	struct FVector GetActorRightVector();
	struct FVector GetActorRelativeScale3D();
	struct FVector GetActorForwardVector();
	void GetActorEyesViewPoint(struct FVector* OutLocation, struct FRotator* OutRotation);
	bool GetActorEnableCollision();
	void GetActorBounds(bool bOnlyCollidingComponents, struct FVector* Origin, struct FVector* BoxExtent);
	void ForceNetUpdate();
	void FlushNetDormancy();
	void EnableInput(class AEngine_PlayerController* PlayerController);
	void DisableInput(class AEngine_PlayerController* PlayerController);
	void DetachRootComponentFromParent(bool bMaintainWorldPosition);
	void AddTickPrerequisiteComponent(class UEngine_ActorComponent* PrerequisiteComponent);
	void AddTickPrerequisiteActor(class AEngine_Actor* PrerequisiteActor);
	class UEngine_ActorComponent* AddComponent(const struct FName& TemplateName, bool bManualAttachment, const struct FTransform& RelativeTransform, class UObject* ComponentTemplateContext);
	bool ActorHasTag(const struct FName& Tag);
};


// Class Engine.BlueprintFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UEngine_BlueprintFunctionLibrary : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.BlueprintFunctionLibrary");
		if (!ptr)
			ptr = UObject::FindClass("Class Engine.BlueprintFunctionLibrary");
		return ptr;
	}

};


// Class Engine.ActorComponent
// 0x0088 (0x00B0 - 0x0028)
class UEngine_ActorComponent : public UObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	struct FEngine_ActorComponentTickFunction          PrimaryComponentTick;                                     // 0x0030(0x0030) (Edit, DisableEditOnInstance)
	TArray<struct FName>                               ComponentTags;                                            // 0x0060(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UEngine_AssetUserData*>               AssetUserData;                                            // 0x0070(0x0010) (Edit, ExportObject, ZeroConstructor)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0080(0x0004) MISSED OFFSET
	unsigned char                                      UnknownData02 : 3;                                        // 0x0084(0x0001)
	unsigned char                                      bReplicates : 1;                                          // 0x0084(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnInstance)
	unsigned char                                      bNetAddressable : 1;                                      // 0x0084(0x0001)
	unsigned char                                      UnknownData03 : 3;                                        // 0x0084(0x0001)
	unsigned char                                      UnknownData04 : 7;                                        // 0x0085(0x0001)
	unsigned char                                      bAutoActivate : 1;                                        // 0x0085(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bIsActive : 1;                                            // 0x0086(0x0001) (Net, Transient)
	unsigned char                                      bEditableWhenInherited : 1;                               // 0x0086(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData05 : 1;                                        // 0x0086(0x0001)
	unsigned char                                      bCanEverAffectNavigation : 1;                             // 0x0086(0x0001) (Edit, Config)
	unsigned char                                      UnknownData06 : 1;                                        // 0x0086(0x0001)
	unsigned char                                      bIsEditorOnly : 1;                                        // 0x0086(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData07[0x1];                                       // 0x0087(0x0001) MISSED OFFSET
	FEngine_Engine_EComponentCreationMethod            CreationMethod;                                           // 0x0088(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      OnComponentActivated;                                     // 0x0089(0x0001) (InstancedReference, BlueprintAssignable)
	unsigned char                                      OnComponentDeactivated;                                   // 0x008A(0x0001) (InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData08[0x5];                                       // 0x008B(0x0005) MISSED OFFSET
	TArray<struct FEngine_SimpleMemberReference>       UCSModifiedProperties;                                    // 0x0090(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData09[0x10];                                      // 0x00A0(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.ActorComponent");
		if (!ptr)
			ptr = UObject::FindClass("Class Engine.ActorComponent");
		return ptr;
	}


	void ToggleActive();
	void SetTickGroup(TEnumAsByte<FEngine_Engine_ETickingGroup> NewTickGroup);
	void SetTickableWhenPaused(bool bTickableWhenPaused);
	void SetIsReplicated(bool ShouldReplicate);
	void SetComponentTickInterval(float TickInterval);
	void SetComponentTickEnabled(bool bEnabled);
	void SetAutoActivate(bool bNewAutoActivate);
	void SetActive(bool bNewActive, bool bReset);
	void RemoveTickPrerequisiteComponent(class UEngine_ActorComponent* PrerequisiteComponent);
	void RemoveTickPrerequisiteActor(class AEngine_Actor* PrerequisiteActor);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveEndPlay(TEnumAsByte<FEngine_Engine_EEndPlayReason> EndPlayReason);
	void ReceiveBeginPlay();
	void OnRep_IsActive();
	void K2_DestroyComponent(class UObject* Object);
	bool IsComponentTickEnabled();
	bool IsBeingDestroyed();
	bool IsActive();
	class AEngine_Actor* GetOwner();
	float GetComponentTickInterval();
	void Deactivate();
	bool ComponentHasTag(const struct FName& Tag);
	void AddTickPrerequisiteComponent(class UEngine_ActorComponent* PrerequisiteComponent);
	void AddTickPrerequisiteActor(class AEngine_Actor* PrerequisiteActor);
	void Activate(bool bReset);
};


// Class Engine.SceneComponent
// 0x0140 (0x01F0 - 0x00B0)
class UEngine_SceneComponent : public UEngine_ActorComponent
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x00B0(0x0008) MISSED OFFSET
	TWeakObjectPtr<class AEngine_PhysicsVolume>        PhysicsVolume;                                            // 0x00B8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UEngine_SceneComponent*                      AttachParent;                                             // 0x00C0(0x0008) (ExportObject, Net, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FName                                       AttachSocketName;                                         // 0x00C8(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	TArray<class UEngine_SceneComponent*>              AttachChildren;                                           // 0x00D0(0x0010) (ExportObject, Net, ZeroConstructor, Transient)
	TArray<class UEngine_SceneComponent*>              ClientAttachedChildren;                                   // 0x00E0(0x0010) (ExportObject, ZeroConstructor, Transient)
	unsigned char                                      UnknownData01[0x2C];                                      // 0x00F0(0x002C) MISSED OFFSET
	struct FVector                                     RelativeLocation;                                         // 0x011C(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	struct FRotator                                    RelativeRotation;                                         // 0x0128(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	struct FVector                                     RelativeScale3D;                                          // 0x0134(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	struct FVector                                     ComponentVelocity;                                        // 0x0140(0x000C) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      bComponentToWorldUpdated : 1;                             // 0x014C(0x0001) (Transient)
	unsigned char                                      UnknownData02 : 1;                                        // 0x014C(0x0001)
	unsigned char                                      bAbsoluteLocation : 1;                                    // 0x014C(0x0001) (Edit, BlueprintVisible, Net)
	unsigned char                                      bAbsoluteRotation : 1;                                    // 0x014C(0x0001) (Edit, BlueprintVisible, Net)
	unsigned char                                      bAbsoluteScale : 1;                                       // 0x014C(0x0001) (Edit, BlueprintVisible, Net)
	unsigned char                                      bVisible : 1;                                             // 0x014C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, Net)
	unsigned char                                      bHiddenInGame : 1;                                        // 0x014C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bShouldBeAttached : 1;                                    // 0x014C(0x0001) (Net, Transient)
	unsigned char                                      bShouldSnapLocationWhenAttached : 1;                      // 0x014D(0x0001) (Net, Transient)
	unsigned char                                      bShouldSnapRotationWhenAttached : 1;                      // 0x014D(0x0001) (Net, Transient)
	unsigned char                                      bShouldUpdatePhysicsVolume : 1;                           // 0x014D(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bBoundsChangeTriggersStreamingDataRebuild : 1;            // 0x014D(0x0001)
	unsigned char                                      bUseAttachParentBound : 1;                                // 0x014D(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData03[0x1];                                       // 0x014E(0x0001) MISSED OFFSET
	TEnumAsByte<FEngine_Engine_EComponentMobility>     Mobility;                                                 // 0x014F(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<FEngine_Engine_EDetailMode>            DetailMode;                                               // 0x0150(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      PhysicsVolumeChangedDelegate;                             // 0x0151(0x0001) (InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData04[0x9E];                                      // 0x0152(0x009E) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.SceneComponent");
		if (!ptr)
			ptr = UObject::FindClass("Class Engine.SceneComponent");
		return ptr;
	}


	void ToggleVisibility(bool bPropagateToChildren);
	bool SnapTo(class UEngine_SceneComponent* InParent, const struct FName& InSocketName);
	void SetWorldScale3D(const struct FVector& NewScale);
	void SetVisibility(bool bNewVisibility, bool bPropagateToChildren);
	void SetShouldUpdatePhysicsVolume(bool bInShouldUpdatePhysicsVolume);
	void SetRelativeScale3D(const struct FVector& NewScale3D);
	void SetMobility(TEnumAsByte<FEngine_Engine_EComponentMobility> NewMobility);
	void SetHiddenInGame(bool NewHidden, bool bPropagateToChildren);
	void SetAbsolute(bool bNewAbsoluteLocation, bool bNewAbsoluteRotation, bool bNewAbsoluteScale);
	void ResetRelativeTransform();
	void OnRep_Visibility(bool OldValue);
	void OnRep_Transform();
	void OnRep_AttachSocketName();
	void OnRep_AttachParent();
	void OnRep_AttachChildren();
	void K2_SetWorldTransform(const struct FTransform& NewTransform, bool bSweep, bool bTeleport, struct FEngine_HitResult* SweepHitResult);
	void K2_SetWorldRotation(const struct FRotator& NewRotation, bool bSweep, bool bTeleport, struct FEngine_HitResult* SweepHitResult);
	void K2_SetWorldLocationAndRotation(const struct FVector& NewLocation, const struct FRotator& NewRotation, bool bSweep, bool bTeleport, struct FEngine_HitResult* SweepHitResult);
	void K2_SetWorldLocation(const struct FVector& NewLocation, bool bSweep, bool bTeleport, struct FEngine_HitResult* SweepHitResult);
	void K2_SetRelativeTransform(const struct FTransform& NewTransform, bool bSweep, bool bTeleport, struct FEngine_HitResult* SweepHitResult);
	void K2_SetRelativeRotation(const struct FRotator& NewRotation, bool bSweep, bool bTeleport, struct FEngine_HitResult* SweepHitResult);
	void K2_SetRelativeLocationAndRotation(const struct FVector& NewLocation, const struct FRotator& NewRotation, bool bSweep, bool bTeleport, struct FEngine_HitResult* SweepHitResult);
	void K2_SetRelativeLocation(const struct FVector& NewLocation, bool bSweep, bool bTeleport, struct FEngine_HitResult* SweepHitResult);
	struct FTransform K2_GetComponentToWorld();
	struct FVector K2_GetComponentScale();
	struct FRotator K2_GetComponentRotation();
	struct FVector K2_GetComponentLocation();
	void K2_DetachFromComponent(FEngine_Engine_EDetachmentRule LocationRule, FEngine_Engine_EDetachmentRule RotationRule, FEngine_Engine_EDetachmentRule ScaleRule, bool bCallModify);
	bool K2_AttachToComponent(class UEngine_SceneComponent* Parent, const struct FName& SocketName, FEngine_Engine_EAttachmentRule LocationRule, FEngine_Engine_EAttachmentRule RotationRule, FEngine_Engine_EAttachmentRule ScaleRule, bool bWeldSimulatedBodies);
	bool K2_AttachTo(class UEngine_SceneComponent* InParent, const struct FName& InSocketName, TEnumAsByte<FEngine_Engine_EAttachLocation> AttachType, bool bWeldSimulatedBodies);
	void K2_AddWorldTransform(const struct FTransform& DeltaTransform, bool bSweep, bool bTeleport, struct FEngine_HitResult* SweepHitResult);
	void K2_AddWorldRotation(const struct FRotator& DeltaRotation, bool bSweep, bool bTeleport, struct FEngine_HitResult* SweepHitResult);
	void K2_AddWorldOffset(const struct FVector& DeltaLocation, bool bSweep, bool bTeleport, struct FEngine_HitResult* SweepHitResult);
	void K2_AddRelativeRotation(const struct FRotator& DeltaRotation, bool bSweep, bool bTeleport, struct FEngine_HitResult* SweepHitResult);
	void K2_AddRelativeLocation(const struct FVector& DeltaLocation, bool bSweep, bool bTeleport, struct FEngine_HitResult* SweepHitResult);
	void K2_AddLocalTransform(const struct FTransform& DeltaTransform, bool bSweep, bool bTeleport, struct FEngine_HitResult* SweepHitResult);
	void K2_AddLocalRotation(const struct FRotator& DeltaRotation, bool bSweep, bool bTeleport, struct FEngine_HitResult* SweepHitResult);
	void K2_AddLocalOffset(const struct FVector& DeltaLocation, bool bSweep, bool bTeleport, struct FEngine_HitResult* SweepHitResult);
	bool IsVisible();
	bool IsSimulatingPhysics(const struct FName& BoneName);
	bool IsAnySimulatingPhysics();
	struct FVector GetUpVector();
	struct FTransform GetSocketTransform(const struct FName& InSocketName, TEnumAsByte<FEngine_Engine_ERelativeTransformSpace> TransformSpace);
	struct FRotator GetSocketRotation(const struct FName& InSocketName);
	struct FQuat GetSocketQuaternion(const struct FName& InSocketName);
	struct FVector GetSocketLocation(const struct FName& InSocketName);
	bool GetShouldUpdatePhysicsVolume();
	struct FVector GetRightVector();
	struct FTransform GetRelativeTransform();
	class AEngine_PhysicsVolume* GetPhysicsVolume();
	void GetParentComponents(TArray<class UEngine_SceneComponent*>* Parents);
	int GetNumChildrenComponents();
	struct FVector GetForwardVector();
	struct FVector GetComponentVelocity();
	void GetChildrenComponents(bool bIncludeAllDescendants, TArray<class UEngine_SceneComponent*>* Children);
	class UEngine_SceneComponent* GetChildComponent(int ChildIndex);
	struct FName GetAttachSocketName();
	class UEngine_SceneComponent* GetAttachParent();
	TArray<struct FName> GetAllSocketNames();
	bool DoesSocketExist(const struct FName& InSocketName);
	void DetachFromParent(bool bMaintainWorldPosition, bool bCallModify);
};


// Class Engine.PrimitiveComponent
// 0x01F0 (0x03E0 - 0x01F0)
class UEngine_PrimitiveComponent : public UEngine_SceneComponent
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x01F0(0x0008) MISSED OFFSET
	float                                              MinDrawDistance;                                          // 0x01F8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              LDMaxDrawDistance;                                        // 0x01FC(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              CachedMaxDrawDistance;                                    // 0x0200(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	TEnumAsByte<FEngine_Engine_ESceneDepthPriorityGroup> DepthPriorityGroup;                                       // 0x0204(0x0001) (ZeroConstructor, IsPlainOldData)
	TEnumAsByte<FEngine_Engine_ESceneDepthPriorityGroup> ViewOwnerDepthPriorityGroup;                              // 0x0205(0x0001) (ZeroConstructor, IsPlainOldData)
	TEnumAsByte<FEngine_Engine_EIndirectLightingCacheQuality> IndirectLightingCacheQuality;                             // 0x0206(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	FEngine_Engine_ELightmapType                       LightmapType;                                             // 0x0207(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bUseMaxLODAsImposter : 1;                                 // 0x0208(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bBatchImpostersAsInstances : 1;                           // 0x0208(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bNeverDistanceCull : 1;                                   // 0x0208(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData01 : 4;                                        // 0x0208(0x0001)
	unsigned char                                      bAlwaysCreatePhysicsState : 1;                            // 0x0208(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bGenerateOverlapEvents : 1;                               // 0x0209(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bMultiBodyOverlap : 1;                                    // 0x0209(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bTraceComplexOnMove : 1;                                  // 0x0209(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bReturnMaterialOnMove : 1;                                // 0x0209(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bUseViewOwnerDepthPriorityGroup : 1;                      // 0x0209(0x0001)
	unsigned char                                      bAllowCullDistanceVolume : 1;                             // 0x0209(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bHasMotionBlurVelocityMeshes : 1;                         // 0x0209(0x0001)
	unsigned char                                      bVisibleInReflectionCaptures : 1;                         // 0x0209(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bVisibleInRayTracing : 1;                                 // 0x020A(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bRenderInMainPass : 1;                                    // 0x020A(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bRenderInDepthPass : 1;                                   // 0x020A(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bReceivesDecals : 1;                                      // 0x020A(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bOwnerNoSee : 1;                                          // 0x020A(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bOnlyOwnerSee : 1;                                        // 0x020A(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bTreatAsBackgroundForOcclusion : 1;                       // 0x020A(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bUseAsOccluder : 1;                                       // 0x020A(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bSelectable : 1;                                          // 0x020B(0x0001)
	unsigned char                                      bForceMipStreaming : 1;                                   // 0x020B(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bHasPerInstanceHitProxies : 1;                            // 0x020B(0x0001)
	unsigned char                                      CastShadow : 1;                                           // 0x020B(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bAffectDynamicIndirectLighting : 1;                       // 0x020B(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bAffectDistanceFieldLighting : 1;                         // 0x020B(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bCastDynamicShadow : 1;                                   // 0x020B(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bCastStaticShadow : 1;                                    // 0x020B(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bCastVolumetricTranslucentShadow : 1;                     // 0x020C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bSelfShadowOnly : 1;                                      // 0x020C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bCastFarShadow : 1;                                       // 0x020C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bCastInsetShadow : 1;                                     // 0x020C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bCastCinematicShadow : 1;                                 // 0x020C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bCastHiddenShadow : 1;                                    // 0x020C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bCastShadowAsTwoSided : 1;                                // 0x020C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bLightAsIfStatic : 1;                                     // 0x020C(0x0001) (Deprecated)
	unsigned char                                      bLightAttachmentsAsGroup : 1;                             // 0x020D(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bExcludeFromLightAttachmentGroup : 1;                     // 0x020D(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bReceiveMobileCSMShadows : 1;                             // 0x020D(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bSingleSampleShadowFromStationaryLights : 1;              // 0x020D(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bIgnoreRadialImpulse : 1;                                 // 0x020D(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bIgnoreRadialForce : 1;                                   // 0x020D(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bApplyImpulseOnDamage : 1;                                // 0x020D(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bReplicatePhysicsToAutonomousProxy : 1;                   // 0x020D(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      AlwaysLoadOnClient : 1;                                   // 0x020E(0x0001)
	unsigned char                                      AlwaysLoadOnServer : 1;                                   // 0x020E(0x0001)
	unsigned char                                      bUseEditorCompositing : 1;                                // 0x020E(0x0001)
	unsigned char                                      bRenderCustomDepth : 1;                                   // 0x020E(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	TEnumAsByte<FEngine_Engine_EHasCustomNavigableGeometry> bHasCustomNavigableGeometry;                              // 0x020F(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x1];                                       // 0x0210(0x0001) MISSED OFFSET
	TEnumAsByte<FEngine_Engine_ECanBeCharacterBase>    CanCharacterStepUpOn;                                     // 0x0211(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FEngine_LightingChannels                    LightingChannels;                                         // 0x0212(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	FEngine_Engine_ERendererStencilMask                CustomDepthStencilWriteMask;                              // 0x0213(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                CustomDepthStencilValue;                                  // 0x0214(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FEngine_CustomPrimitiveData                 CustomPrimitiveData;                                      // 0x0218(0x0010) (Edit)
	int                                                TranslucencySortPriority;                                 // 0x0228(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                VisibilityId;                                             // 0x022C(0x0004) (ZeroConstructor, IsPlainOldData)
	TArray<class UEngine_RuntimeVirtualTexture*>       RuntimeVirtualTextures;                                   // 0x0230(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	int8_t                                             VirtualTextureLodBias;                                    // 0x0240(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	int8_t                                             VirtualTextureCullMips;                                   // 0x0241(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	int8_t                                             VirtualTextureMinCoverage;                                // 0x0242(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	FEngine_Engine_ERuntimeVirtualTextureMainPassType  VirtualTextureRenderPassType;                             // 0x0243(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x0244(0x0004) MISSED OFFSET
	float                                              LpvBiasMultiplier;                                        // 0x0248(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x8];                                       // 0x024C(0x0008) MISSED OFFSET
	float                                              BoundsScale;                                              // 0x0254(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x10];                                      // 0x0258(0x0010) MISSED OFFSET
	TArray<class AEngine_Actor*>                       MoveIgnoreActors;                                         // 0x0268(0x0010) (ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UEngine_PrimitiveComponent*>          MoveIgnoreComponents;                                     // 0x0278(0x0010) (ExportObject, ZeroConstructor, Transient, DuplicateTransient)
	unsigned char                                      UnknownData06[0x10];                                      // 0x0288(0x0010) MISSED OFFSET
	struct FEngine_BodyInstance                        BodyInstance;                                             // 0x0298(0x0110) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      OnComponentHit;                                           // 0x03A8(0x0001) (InstancedReference, BlueprintAssignable)
	unsigned char                                      OnComponentBeginOverlap;                                  // 0x03A9(0x0001) (InstancedReference, BlueprintAssignable)
	unsigned char                                      OnComponentEndOverlap;                                    // 0x03AA(0x0001) (InstancedReference, BlueprintAssignable)
	unsigned char                                      OnComponentWake;                                          // 0x03AB(0x0001) (InstancedReference, BlueprintAssignable)
	unsigned char                                      OnComponentSleep;                                         // 0x03AC(0x0001) (InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData07[0x1];                                       // 0x03AD(0x0001) MISSED OFFSET
	unsigned char                                      OnBeginCursorOver;                                        // 0x03AE(0x0001) (InstancedReference, BlueprintAssignable)
	unsigned char                                      OnEndCursorOver;                                          // 0x03AF(0x0001) (InstancedReference, BlueprintAssignable)
	unsigned char                                      OnClicked;                                                // 0x03B0(0x0001) (InstancedReference, BlueprintAssignable)
	unsigned char                                      OnReleased;                                               // 0x03B1(0x0001) (InstancedReference, BlueprintAssignable)
	unsigned char                                      OnInputTouchBegin;                                        // 0x03B2(0x0001) (InstancedReference, BlueprintAssignable)
	unsigned char                                      OnInputTouchEnd;                                          // 0x03B3(0x0001) (InstancedReference, BlueprintAssignable)
	unsigned char                                      OnInputTouchEnter;                                        // 0x03B4(0x0001) (InstancedReference, BlueprintAssignable)
	unsigned char                                      OnInputTouchLeave;                                        // 0x03B5(0x0001) (InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData08[0x1A];                                      // 0x03B6(0x001A) MISSED OFFSET
	class UEngine_PrimitiveComponent*                  LODParentPrimitive;                                       // 0x03D0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData09[0x8];                                       // 0x03D8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.PrimitiveComponent");
		if (!ptr)
			ptr = UObject::FindClass("Class Engine.PrimitiveComponent");
		return ptr;
	}


	void WakeRigidBody(const struct FName& BoneName);
	void WakeAllRigidBodies();
	void SetWalkableSlopeOverride(const struct FEngine_WalkableSlopeOverride& NewOverride);
	void SetUseCCD(bool InUseCCD, const struct FName& BoneName);
	void SetTranslucentSortPriority(int NewTranslucentSortPriority);
	void SetSingleSampleShadowFromStationaryLights(bool bNewSingleSampleShadowFromStationaryLights);
	void SetSimulatePhysics(bool bSimulate);
	void SetRenderInMainPass(bool bValue);
	void SetRenderCustomDepth(bool bValue);
	void SetReceivesDecals(bool bNewReceivesDecals);
	void SetPhysMaterialOverride(class UEngine_PhysicalMaterial* NewPhysMaterial);
	void SetPhysicsMaxAngularVelocityInRadians(float NewMaxAngVel, bool bAddToCurrent, const struct FName& BoneName);
	void SetPhysicsMaxAngularVelocityInDegrees(float NewMaxAngVel, bool bAddToCurrent, const struct FName& BoneName);
	void SetPhysicsMaxAngularVelocity(float NewMaxAngVel, bool bAddToCurrent, const struct FName& BoneName);
	void SetPhysicsLinearVelocity(const struct FVector& NewVel, bool bAddToCurrent, const struct FName& BoneName);
	void SetPhysicsAngularVelocityInRadians(const struct FVector& NewAngVel, bool bAddToCurrent, const struct FName& BoneName);
	void SetPhysicsAngularVelocityInDegrees(const struct FVector& NewAngVel, bool bAddToCurrent, const struct FName& BoneName);
	void SetPhysicsAngularVelocity(const struct FVector& NewAngVel, bool bAddToCurrent, const struct FName& BoneName);
	void SetOwnerNoSee(bool bNewOwnerNoSee);
	void SetOnlyOwnerSee(bool bNewOnlyOwnerSee);
	void SetNotifyRigidBodyCollision(bool bNewNotifyRigidBodyCollision);
	void SetMaterialByName(const struct FName& MaterialSlotName, class UEngine_MaterialInterface* Material);
	void SetMaterial(int ElementIndex, class UEngine_MaterialInterface* Material);
	void SetMassScale(const struct FName& BoneName, float InMassScale);
	void SetMassOverrideInKg(const struct FName& BoneName, float MassInKg, bool bOverrideMass);
	void SetLinearDamping(float InDamping);
	void SetLightAttachmentsAsGroup(bool bInLightAttachmentsAsGroup);
	void SetGenerateOverlapEvents(bool bInGenerateOverlapEvents);
	void SetExcludeFromLightAttachmentGroup(bool bInExcludeFromLightAttachmentGroup);
	void SetEnableGravity(bool bGravityEnabled);
	void SetCustomPrimitiveDataVector4(int DataIndex, const struct FVector4& Value);
	void SetCustomPrimitiveDataVector3(int DataIndex, const struct FVector& Value);
	void SetCustomPrimitiveDataVector2(int DataIndex, const struct FVector2D& Value);
	void SetCustomPrimitiveDataFloat(int DataIndex, float Value);
	void SetCustomDepthStencilWriteMask(FEngine_Engine_ERendererStencilMask WriteMaskBit);
	void SetCustomDepthStencilValue(int Value);
	void SetCullDistance(float NewCullDistance);
	void SetConstraintMode(TEnumAsByte<FEngine_Engine_EDOFMode> ConstraintMode);
	void SetCollisionResponseToChannel(TEnumAsByte<FEngine_Engine_ECollisionChannel> Channel, TEnumAsByte<FEngine_Engine_ECollisionResponse> NewResponse);
	void SetCollisionResponseToAllChannels(TEnumAsByte<FEngine_Engine_ECollisionResponse> NewResponse);
	void SetCollisionProfileName(const struct FName& InCollisionProfileName);
