#pragma once

// Name: , Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x1)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class UMG.RichTextBlockDecorator
// 0x0000 (0x0028 - 0x0028)
class UUMG_RichTextBlockDecorator : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.RichTextBlockDecorator");
		if (!ptr)
			ptr = UObject::FindClass("Class UMG.RichTextBlockDecorator");
		return ptr;
	}

};


// Class UMG.Visual
// 0x0000 (0x0028 - 0x0028)
class UUMG_Visual : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.Visual");
		if (!ptr)
			ptr = UObject::FindClass("Class UMG.Visual");
		return ptr;
	}

};


// Class UMG.Widget
// 0x00E0 (0x0108 - 0x0028)
class UUMG_Widget : public UUMG_Visual
{
public:
	class UUMG_PanelSlot*                              Slot;                                                     // 0x0028(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FScriptDelegate                             bIsEnabledDelegate;                                       // 0x0030(0x0014) (ZeroConstructor, InstancedReference)
	struct FText                                       ToolTipText;                                              // 0x0040(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FScriptDelegate                             ToolTipTextDelegate;                                      // 0x0058(0x0014) (ZeroConstructor, InstancedReference)
	class UUMG_Widget*                                 ToolTipWidget;                                            // 0x0068(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	struct FScriptDelegate                             ToolTipWidgetDelegate;                                    // 0x0070(0x0014) (ZeroConstructor, InstancedReference)
	struct FScriptDelegate                             VisibilityDelegate;                                       // 0x0080(0x0014) (ZeroConstructor, InstancedReference)
	struct FUMG_WidgetTransform                        RenderTransform;                                          // 0x0090(0x001C) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FVector2D                                   RenderTransformPivot;                                     // 0x00AC(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bIsVariable : 1;                                          // 0x00B4(0x0001)
	unsigned char                                      bCreatedByConstructionScript : 1;                         // 0x00B4(0x0001) (Transient)
	unsigned char                                      bIsEnabled : 1;                                           // 0x00B4(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bOverride_Cursor : 1;                                     // 0x00B4(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x00B5(0x0003) MISSED OFFSET
	class UUMG_SlateAccessibleWidgetData*              AccessibleWidgetData;                                     // 0x00B8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      bIsVolatile : 1;                                          // 0x00C0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	TEnumAsByte<FCoreUObject_EMouseCursor>             Cursor;                                                   // 0x00C1(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	FSlateCore_SlateCore_EWidgetClipping               Clipping;                                                 // 0x00C2(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	FUMG_UMG_ESlateVisibility                          Visibility;                                               // 0x00C3(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              RenderOpacity;                                            // 0x00C4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	class UUMG_WidgetNavigation*                       Navigation;                                               // 0x00C8(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	FSlateCore_SlateCore_EFlowDirectionPreference      FlowDirectionPreference;                                  // 0x00D0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x27];                                      // 0x00D1(0x0027) MISSED OFFSET
	TArray<class UUMG_PropertyBinding*>                NativeBindings;                                           // 0x00F8(0x0010) (ZeroConstructor, Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.Widget");
		if (!ptr)
			ptr = UObject::FindClass("Class UMG.Widget");
		return ptr;
	}


	void SetVisibility(FUMG_UMG_ESlateVisibility InVisibility);
	void SetUserFocus(class AEngine_PlayerController* PlayerController);
	void SetToolTipText(const struct FText& InToolTipText);
	void SetToolTip(class UUMG_Widget* Widget);
	void SetRenderTranslation(const struct FVector2D& Translation);
	void SetRenderTransformPivot(const struct FVector2D& Pivot);
	void SetRenderTransformAngle(float Angle);
	void SetRenderTransform(const struct FUMG_WidgetTransform& InTransform);
	void SetRenderShear(const struct FVector2D& Shear);
	void SetRenderScale(const struct FVector2D& Scale);
	void SetRenderOpacity(float InOpacity);
	void SetNavigationRuleExplicit(FSlateCore_SlateCore_EUINavigation Direction, class UUMG_Widget* InWidget);
	void SetNavigationRuleCustomBoundary(FSlateCore_SlateCore_EUINavigation Direction, const struct FScriptDelegate& InCustomDelegate);
	void SetNavigationRuleCustom(FSlateCore_SlateCore_EUINavigation Direction, const struct FScriptDelegate& InCustomDelegate);
	void SetNavigationRuleBase(FSlateCore_SlateCore_EUINavigation Direction, FSlateCore_SlateCore_EUINavigationRule Rule);
	void SetNavigationRule(FSlateCore_SlateCore_EUINavigation Direction, FSlateCore_SlateCore_EUINavigationRule Rule, const struct FName& WidgetToFocus);
	void SetKeyboardFocus();
	void SetIsEnabled(bool bInIsEnabled);
	void SetFocus();
	void SetCursor(TEnumAsByte<FCoreUObject_EMouseCursor> InCursor);
	void SetClipping(FSlateCore_SlateCore_EWidgetClipping InClipping);
	void SetAllNavigationRules(FSlateCore_SlateCore_EUINavigationRule Rule, const struct FName& WidgetToFocus);
	void ResetCursor();
	void RemoveFromParent();
	struct FUMG_EventReply OnReply__DelegateSignature();
	struct FUMG_EventReply OnPointerEvent__DelegateSignature(const struct FSlateCore_Geometry& MyGeometry, const struct FSlateCore_PointerEvent& MouseEvent);
	bool IsVisible();
	bool IsHovered();
	void InvalidateLayoutAndVolatility();
	bool HasUserFocusedDescendants(class AEngine_PlayerController* PlayerController);
	bool HasUserFocus(class AEngine_PlayerController* PlayerController);
	bool HasMouseCaptureByUser(int UserIndex, int PointerIndex);
	bool HasMouseCapture();
	bool HasKeyboardFocus();
	bool HasFocusedDescendants();
	bool HasAnyUserFocus();
	class UUMG_Widget* GetWidget__DelegateSignature();
	FUMG_UMG_ESlateVisibility GetVisibility();
	struct FSlateCore_Geometry GetTickSpaceGeometry();
	struct FText GetText__DelegateSignature();
	FUMG_UMG_ESlateVisibility GetSlateVisibility__DelegateSignature();
	struct FSlateCore_SlateColor GetSlateColor__DelegateSignature();
	struct FSlateCore_SlateBrush GetSlateBrush__DelegateSignature();
	float GetRenderTransformAngle();
	float GetRenderOpacity();
	class UUMG_PanelWidget* GetParent();
	struct FSlateCore_Geometry GetPaintSpaceGeometry();
	class AEngine_PlayerController* GetOwningPlayer();
	class UEngine_LocalPlayer* GetOwningLocalPlayer();
	TEnumAsByte<FCoreUObject_EMouseCursor> GetMouseCursor__DelegateSignature();
	struct FLinearColor GetLinearColor__DelegateSignature();
	bool GetIsEnabled();
	int GetInt32__DelegateSignature();
	class UEngine_GameInstance* GetGameInstance();
	float GetFloat__DelegateSignature();
	struct FVector2D GetDesiredSize();
	FSlateCore_SlateCore_EWidgetClipping GetClipping();
	FSlateCore_SlateCore_ECheckBoxState GetCheckBoxState__DelegateSignature();
	struct FSlateCore_Geometry GetCachedGeometry();
	bool GetBool__DelegateSignature();
	class UUMG_Widget* GenerateWidgetForString__DelegateSignature(const struct FString& Item);
	class UUMG_Widget* GenerateWidgetForObject__DelegateSignature(class UObject* Item);
	void ForceVolatile(bool bForce);
	void ForceLayoutPrepass();
};


// Class UMG.Image
// 0x0108 (0x0210 - 0x0108)
class UUMG_Image : public UUMG_Widget
{
public:
	struct FSlateCore_SlateBrush                       Brush;                                                    // 0x0108(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FScriptDelegate                             BrushDelegate;                                            // 0x0190(0x0014) (ZeroConstructor, InstancedReference)
	struct FLinearColor                                ColorAndOpacity;                                          // 0x01A0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FScriptDelegate                             ColorAndOpacityDelegate;                                  // 0x01B0(0x0014) (ZeroConstructor, InstancedReference)
	bool                                               bFlipForRightToLeftFlowDirection;                         // 0x01C0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x01C1(0x0003) MISSED OFFSET
	struct FScriptDelegate                             OnMouseButtonDownEvent;                                   // 0x01C4(0x0014) (Edit, ZeroConstructor, InstancedReference)
	unsigned char                                      UnknownData01[0x3C];                                      // 0x01D4(0x003C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.Image");
		if (!ptr)
			ptr = UObject::FindClass("Class UMG.Image");
		return ptr;
	}


	void SetOpacity(float InOpacity);
	void SetColorAndOpacity(const struct FLinearColor& InColorAndOpacity);
	void SetBrushTintColor(const struct FSlateCore_SlateColor& TintColor);
	void SetBrushSize(const struct FVector2D& DesiredSize);
	void SetBrushResourceObject(class UObject* ResourceObject);
	void SetBrushFromTextureDynamic(class UEngine_Texture2DDynamic* Texture, bool bMatchSize);
	void SetBrushFromTexture(class UEngine_Texture2D* Texture, bool bMatchSize);
	void SetBrushFromSoftTexture(bool bMatchSize);
	void SetBrushFromSoftMaterial();
	void SetBrushFromMaterial(class UEngine_MaterialInterface* Material);
	void SetBrushFromAtlasInterface(const TScriptInterface<class UEngine_SlateTextureAtlasInterface>& AtlasRegion, bool bMatchSize);
	void SetBrushFromAsset(class UEngine_SlateBrushAsset* Asset);
	void SetBrush(const struct FSlateCore_SlateBrush& InBrush);
	class UEngine_MaterialInstanceDynamic* GetDynamicMaterial();
};


// Class UMG.PanelWidget
// 0x0018 (0x0120 - 0x0108)
class UUMG_PanelWidget : public UUMG_Widget
{
public:
	TArray<class UUMG_PanelSlot*>                      Slots;                                                    // 0x0108(0x0010) (ExportObject, ZeroConstructor)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0118(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.PanelWidget");
		if (!ptr)
			ptr = UObject::FindClass("Class UMG.PanelWidget");
		return ptr;
	}


	bool RemoveChildAt(int Index);
	bool RemoveChild(class UUMG_Widget* Content);
	bool HasChild(class UUMG_Widget* Content);
	bool HasAnyChildren();
	int GetChildrenCount();
	int GetChildIndex(class UUMG_Widget* Content);
	class UUMG_Widget* GetChildAt(int Index);
	TArray<class UUMG_Widget*> GetAllChildren();
	void ClearChildren();
	class UUMG_PanelSlot* AddChild(class UUMG_Widget* Content);
};


// Class UMG.ContentWidget
// 0x0000 (0x0120 - 0x0120)
class UUMG_ContentWidget : public UUMG_PanelWidget
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.ContentWidget");
		if (!ptr)
			ptr = UObject::FindClass("Class UMG.ContentWidget");
		return ptr;
	}


	class UUMG_PanelSlot* SetContent(class UUMG_Widget* Content);
	class UUMG_PanelSlot* GetContentSlot();
	class UUMG_Widget* GetContent();
};


// Class UMG.Button
// 0x0308 (0x0428 - 0x0120)
class UUMG_Button : public UUMG_ContentWidget
{
public:
	class USlateCore_SlateWidgetStyleAsset*            Style;                                                    // 0x0120(0x0008) (ZeroConstructor, Deprecated, IsPlainOldData)
	struct FSlateCore_ButtonStyle                      WidgetStyle;                                              // 0x0128(0x0278) (Edit, BlueprintVisible)
	struct FLinearColor                                ColorAndOpacity;                                          // 0x03A0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                BackgroundColor;                                          // 0x03B0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<FSlateCore_SlateCore_EButtonClickMethod> ClickMethod;                                              // 0x03C0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<FSlateCore_SlateCore_EButtonTouchMethod> TouchMethod;                                              // 0x03C1(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<FSlateCore_SlateCore_EButtonPressMethod> PressMethod;                                              // 0x03C2(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsFocusable;                                              // 0x03C3(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x03C4(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnClicked;                                                // 0x03C8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnPressed;                                                // 0x03D8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnReleased;                                               // 0x03E8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnHovered;                                                // 0x03F8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnUnhovered;                                              // 0x0408(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData01[0x10];                                      // 0x0418(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.Button");
		if (!ptr)
			ptr = UObject::FindClass("Class UMG.Button");
		return ptr;
	}


	void SetTouchMethod(TEnumAsByte<FSlateCore_SlateCore_EButtonTouchMethod> InTouchMethod);
	void SetStyle(const struct FSlateCore_ButtonStyle& InStyle);
	void SetPressMethod(TEnumAsByte<FSlateCore_SlateCore_EButtonPressMethod> InPressMethod);
	void SetColorAndOpacity(const struct FLinearColor& InColorAndOpacity);
	void SetClickMethod(TEnumAsByte<FSlateCore_SlateCore_EButtonClickMethod> InClickMethod);
	void SetBackgroundColor(const struct FLinearColor& InBackgroundColor);
	bool IsPressed();
};


// Class UMG.CanvasPanel
// 0x0010 (0x0130 - 0x0120)
class UUMG_CanvasPanel : public UUMG_PanelWidget
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0120(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.CanvasPanel");
		if (!ptr)
			ptr = UObject::FindClass("Class UMG.CanvasPanel");
		return ptr;
	}


	class UUMG_CanvasPanelSlot* AddChildToCanvas(class UUMG_Widget* Content);
};


// Class UMG.HorizontalBox
// 0x0010 (0x0130 - 0x0120)
class UUMG_HorizontalBox : public UUMG_PanelWidget
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0120(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.HorizontalBox");
		if (!ptr)
			ptr = UObject::FindClass("Class UMG.HorizontalBox");
		return ptr;
	}


	class UUMG_HorizontalBoxSlot* AddChildToHorizontalBox(class UUMG_Widget* Content);
};


// Class UMG.ListViewBase
// 0x0110 (0x0218 - 0x0108)
class UUMG_ListViewBase : public UUMG_Widget
{
public:
	class UClass*                                      EntryWidgetClass;                                         // 0x0108(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              WheelScrollMultiplier;                                    // 0x0110(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bEnableScrollAnimation;                                   // 0x0114(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bEnableFixedLineOffset;                                   // 0x0115(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0116(0x0002) MISSED OFFSET
	float                                              FixedLineScrollOffset;                                    // 0x0118(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x011C(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    BP_OnEntryGenerated;                                      // 0x0120(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    BP_OnEntryReleased;                                       // 0x0130(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FUMG_UserWidgetPool                         EntryWidgetPool;                                          // 0x0140(0x0080) (Transient)
	unsigned char                                      UnknownData02[0x58];                                      // 0x01C0(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.ListViewBase");
		if (!ptr)
			ptr = UObject::FindClass("Class UMG.ListViewBase");
		return ptr;
	}


	void SetWheelScrollMultiplier(float NewWheelScrollMultiplier);
	void SetScrollOffset(float InScrollOffset);
	void SetScrollbarVisibility(FUMG_UMG_ESlateVisibility InVisibility);
	void ScrollToTop();
	void ScrollToBottom();
	void RequestRefresh();
	void RegenerateAllEntries();
	TArray<class UUMG_UserWidget*> GetDisplayedEntryWidgets();
};


// Class UMG.TextLayoutWidget
// 0x0020 (0x0128 - 0x0108)
class UUMG_TextLayoutWidget : public UUMG_Widget
{
public:
	struct FUMG_ShapedTextOptions                      ShapedTextOptions;                                        // 0x0108(0x0003) (Edit, BlueprintVisible, BlueprintReadOnly)
	TEnumAsByte<FSlate_Slate_ETextJustify>             Justification;                                            // 0x010B(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	FSlate_Slate_ETextWrappingPolicy                   WrappingPolicy;                                           // 0x010C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      AutoWrapText : 1;                                         // 0x010D(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData00[0x2];                                       // 0x010E(0x0002) MISSED OFFSET
	float                                              WrapTextAt;                                               // 0x0110(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FSlateCore_Margin                           Margin;                                                   // 0x0114(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              LineHeightPercentage;                                     // 0x0124(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.TextLayoutWidget");
		if (!ptr)
			ptr = UObject::FindClass("Class UMG.TextLayoutWidget");
		return ptr;
	}


	void SetJustification(TEnumAsByte<FSlate_Slate_ETextJustify> InJustification);
};


// Class UMG.WidgetComponent
// 0x0120 (0x0520 - 0x0400)
class UUMG_WidgetComponent : public UEngine_MeshComponent
{
public:
	FUMG_UMG_EWidgetSpace                              Space;                                                    // 0x0400(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	FUMG_UMG_EWidgetTimingPolicy                       TimingPolicy;                                             // 0x0401(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0402(0x0006) MISSED OFFSET
	class UClass*                                      WidgetClass;                                              // 0x0408(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FIntPoint                                   DrawSize;                                                 // 0x0410(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bManuallyRedraw;                                          // 0x0418(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bRedrawRequested;                                         // 0x0419(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x041A(0x0002) MISSED OFFSET
	float                                              RedrawTime;                                               // 0x041C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x8];                                       // 0x0420(0x0008) MISSED OFFSET
	struct FIntPoint                                   CurrentDrawSize;                                          // 0x0428(0x0008) (ZeroConstructor, IsPlainOldData)
	bool                                               bDrawAtDesiredSize;                                       // 0x0430(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x0431(0x0003) MISSED OFFSET
	struct FVector2D                                   Pivot;                                                    // 0x0434(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bReceiveHardwareInput;                                    // 0x043C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bWindowFocusable;                                         // 0x043D(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	FUMG_UMG_EWindowVisibility                         WindowVisibility;                                         // 0x043E(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bApplyGammaCorrection;                                    // 0x043F(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	class UEngine_LocalPlayer*                         OwnerPlayer;                                              // 0x0440(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                BackgroundColor;                                          // 0x0448(0x0010) (Edit, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                TintColorAndOpacity;                                      // 0x0458(0x0010) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              OpacityFromTexture;                                       // 0x0468(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	FUMG_UMG_EWidgetBlendMode                          BlendMode;                                                // 0x046C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bIsTwoSided;                                              // 0x046D(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               TickWhenOffscreen;                                        // 0x046E(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x1];                                       // 0x046F(0x0001) MISSED OFFSET
	class UUMG_UserWidget*                             Widget;                                                   // 0x0470(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, IsPlainOldData)
	unsigned char                                      UnknownData05[0x20];                                      // 0x0478(0x0020) MISSED OFFSET
	class UEngine_BodySetup*                           BodySetup;                                                // 0x0498(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class UEngine_MaterialInterface*                   TranslucentMaterial;                                      // 0x04A0(0x0008) (ZeroConstructor, IsPlainOldData)
	class UEngine_MaterialInterface*                   TranslucentMaterial_OneSided;                             // 0x04A8(0x0008) (ZeroConstructor, IsPlainOldData)
	class UEngine_MaterialInterface*                   OpaqueMaterial;                                           // 0x04B0(0x0008) (ZeroConstructor, IsPlainOldData)
	class UEngine_MaterialInterface*                   OpaqueMaterial_OneSided;                                  // 0x04B8(0x0008) (ZeroConstructor, IsPlainOldData)
	class UEngine_MaterialInterface*                   MaskedMaterial;                                           // 0x04C0(0x0008) (ZeroConstructor, IsPlainOldData)
	class UEngine_MaterialInterface*                   MaskedMaterial_OneSided;                                  // 0x04C8(0x0008) (ZeroConstructor, IsPlainOldData)
	class UEngine_TextureRenderTarget2D*               RenderTarget;                                             // 0x04D0(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	class UEngine_MaterialInstanceDynamic*             MaterialInstance;                                         // 0x04D8(0x0008) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               bAddedToScreen;                                           // 0x04E0(0x0001) (ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData)
	bool                                               bEditTimeUsable;                                          // 0x04E1(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x2];                                       // 0x04E2(0x0002) MISSED OFFSET
	struct FName                                       SharedLayerName;                                          // 0x04E4(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                LayerZOrder;                                              // 0x04EC(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	FUMG_UMG_EWidgetGeometryMode                       GeometryMode;                                             // 0x04F0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData07[0x3];                                       // 0x04F1(0x0003) MISSED OFFSET
	float                                              CylinderArcAngle;                                         // 0x04F4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData08[0x28];                                      // 0x04F8(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.WidgetComponent");
		if (!ptr)
			ptr = UObject::FindClass("Class UMG.WidgetComponent");
		return ptr;
	}


	void SetWindowVisibility(FUMG_UMG_EWindowVisibility InVisibility);
	void SetWindowFocusable(bool bInWindowFocusable);
	void SetWidgetSpace(FUMG_UMG_EWidgetSpace NewSpace);
	void SetWidget(class UUMG_UserWidget* Widget);
	void SetTwoSided(bool bWantTwoSided);
	void SetTintColorAndOpacity(const struct FLinearColor& NewTintColorAndOpacity);
	void SetTickWhenOffscreen(bool bWantTickWhenOffscreen);
	void SetRedrawTime(float InRedrawTime);
	void SetPivot(const struct FVector2D& InPivot);
	void SetOwnerPlayer(class UEngine_LocalPlayer* LocalPlayer);
	void SetManuallyRedraw(bool bUseManualRedraw);
	void SetGeometryMode(FUMG_UMG_EWidgetGeometryMode InGeometryMode);
	void SetDrawSize(const struct FVector2D& Size);
	void SetDrawAtDesiredSize(bool bInDrawAtDesiredSize);
	void SetCylinderArcAngle(float InCylinderArcAngle);
	void SetBackgroundColor(const struct FLinearColor& NewBackgroundColor);
	void RequestRedraw();
	FUMG_UMG_EWindowVisibility GetWindowVisiblility();
	bool GetWindowFocusable();
	FUMG_UMG_EWidgetSpace GetWidgetSpace();
	class UUMG_UserWidget* GetUserWidgetObject();
	bool GetTwoSided();
	bool GetTickWhenOffscreen();
	class UEngine_TextureRenderTarget2D* GetRenderTarget();
	float GetRedrawTime();
	struct FVector2D GetPivot();
	class UEngine_LocalPlayer* GetOwnerPlayer();
	class UEngine_MaterialInstanceDynamic* GetMaterialInstance();
	bool GetManuallyRedraw();
	FUMG_UMG_EWidgetGeometryMode GetGeometryMode();
	struct FVector2D GetDrawSize();
	bool GetDrawAtDesiredSize();
	float GetCylinderArcAngle();
	struct FVector2D GetCurrentDrawSize();
};


// Class UMG.Overlay
// 0x0010 (0x0130 - 0x0120)
class UUMG_Overlay : public UUMG_PanelWidget
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0120(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.Overlay");
		if (!ptr)
			ptr = UObject::FindClass("Class UMG.Overlay");
		return ptr;
	}


	class UUMG_OverlaySlot* AddChildToOverlay(class UUMG_Widget* Content);
};


// Class UMG.RichTextBlock
// 0x0540 (0x0668 - 0x0128)
class UUMG_RichTextBlock : public UUMG_TextLayoutWidget
{
public:
	struct FText                                       Text;                                                     // 0x0128(0x0018) (Edit)
	class UEngine_DataTable*                           TextStyleSet;                                             // 0x0140(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<class UClass*>                              DecoratorClasses;                                         // 0x0148(0x0010) (Edit, ZeroConstructor)
	bool                                               bOverrideDefaultStyle;                                    // 0x0158(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0159(0x0007) MISSED OFFSET
	struct FSlateCore_TextBlockStyle                   DefaultTextStyleOverride;                                 // 0x0160(0x0268) (Edit)
	float                                              MinDesiredWidth;                                          // 0x03C8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x26C];                                     // 0x03CC(0x026C) MISSED OFFSET
	TArray<class UUMG_RichTextBlockDecorator*>         InstanceDecorators;                                       // 0x0638(0x0010) (ZeroConstructor, Transient)
	unsigned char                                      UnknownData02[0x20];                                      // 0x0648(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.RichTextBlock");
		if (!ptr)
			ptr = UObject::FindClass("Class UMG.RichTextBlock");
		return ptr;
	}


	void SetTextStyleSet(class UEngine_DataTable* NewTextStyleSet);
	void SetText(const struct FText& InText);
	void SetMinDesiredWidth(float InMinDesiredWidth);
	void SetDefaultTextStyle(const struct FSlateCore_TextBlockStyle& InDefaultTextStyle);
	void SetDefaultStrikeBrush(struct FSlateCore_SlateBrush* InStrikeBrush);
	void SetDefaultShadowOffset(const struct FVector2D& InShadowOffset);
	void SetDefaultShadowColorAndOpacity(const struct FLinearColor& InShadowColorAndOpacity);
	void SetDefaultFont(const struct FSlateCore_SlateFontInfo& InFontInfo);
	void SetDefaultColorAndOpacity(const struct FSlateCore_SlateColor& InColorAndOpacity);
	void SetAutoWrapText(bool InAutoTextWrap);
	struct FText GetText();
	class UUMG_RichTextBlockDecorator* GetDecoratorByClass(class UClass* DecoratorClass);
	void ClearAllDefaultStyleOverrides();
};


// Class UMG.RichTextBlockImageDecorator
// 0x0008 (0x0030 - 0x0028)
class UUMG_RichTextBlockImageDecorator : public UUMG_RichTextBlockDecorator
{
public:
	class UEngine_DataTable*                           ImageSet;                                                 // 0x0028(0x0008) (Edit, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.RichTextBlockImageDecorator");
		if (!ptr)
			ptr = UObject::FindClass("Class UMG.RichTextBlockImageDecorator");
		return ptr;
	}

};


// Class UMG.ScrollBox
// 0x0760 (0x0880 - 0x0120)
class UUMG_ScrollBox : public UUMG_PanelWidget
{
public:
	struct FSlateCore_ScrollBoxStyle                   WidgetStyle;                                              // 0x0120(0x0228) (Edit, BlueprintVisible)
	struct FSlateCore_ScrollBarStyle                   WidgetBarStyle;                                           // 0x0348(0x04D0) (Edit, BlueprintVisible)
	class USlateCore_SlateWidgetStyleAsset*            Style;                                                    // 0x0818(0x0008) (ZeroConstructor, Deprecated, IsPlainOldData)
	class USlateCore_SlateWidgetStyleAsset*            BarStyle;                                                 // 0x0820(0x0008) (ZeroConstructor, Deprecated, IsPlainOldData)
	TEnumAsByte<FSlateCore_SlateCore_EOrientation>     Orientation;                                              // 0x0828(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	FUMG_UMG_ESlateVisibility                          ScrollBarVisibility;                                      // 0x0829(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	FSlateCore_SlateCore_EConsumeMouseWheel            ConsumeMouseWheel;                                        // 0x082A(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1];                                       // 0x082B(0x0001) MISSED OFFSET
	struct FVector2D                                   ScrollbarThickness;                                       // 0x082C(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FSlateCore_Margin                           ScrollbarPadding;                                         // 0x0834(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               AlwaysShowScrollbar;                                      // 0x0844(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               AlwaysShowScrollbarTrack;                                 // 0x0845(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               AllowOverscroll;                                          // 0x0846(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bAnimateWheelScrolling;                                   // 0x0847(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	FSlate_Slate_EDescendantScrollDestination          NavigationDestination;                                    // 0x0848(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0849(0x0003) MISSED OFFSET
	float                                              NavigationScrollPadding;                                  // 0x084C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bAllowRightClickDragScrolling;                            // 0x0850(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0851(0x0003) MISSED OFFSET
	float                                              WheelScrollMultiplier;                                    // 0x0854(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnUserScrolled;                                           // 0x0858(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData03[0x18];                                      // 0x0868(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.ScrollBox");
		if (!ptr)
			ptr = UObject::FindClass("Class UMG.ScrollBox");
		return ptr;
	}


	void SetWheelScrollMultiplier(float NewWheelScrollMultiplier);
	void SetScrollOffset(float NewScrollOffset);
	void SetScrollbarVisibility(FUMG_UMG_ESlateVisibility NewScrollBarVisibility);
	void SetScrollbarThickness(const struct FVector2D& NewScrollbarThickness);
	void SetScrollbarPadding(const struct FSlateCore_Margin& NewScrollbarPadding);
	void SetOrientation(TEnumAsByte<FSlateCore_SlateCore_EOrientation> NewOrientation);
	void SetConsumeMouseWheel(FSlateCore_SlateCore_EConsumeMouseWheel NewConsumeMouseWheel);
	void SetAnimateWheelScrolling(bool bShouldAnimateWheelScrolling);
	void SetAlwaysShowScrollbar(bool NewAlwaysShowScrollbar);
	void SetAllowOverscroll(bool NewAllowOverscroll);
	void ScrollWidgetIntoView(class UUMG_Widget* WidgetToFind, bool AnimateScroll, FSlate_Slate_EDescendantScrollDestination ScrollDestination);
	void ScrollToStart();
	void ScrollToEnd();
	float GetViewOffsetFraction();
	float GetScrollOffsetOfEnd();
	float GetScrollOffset();
	void EndInertialScrolling();
};


// Class UMG.TextBlock
// 0x01D0 (0x02F8 - 0x0128)
class UUMG_TextBlock : public UUMG_TextLayoutWidget
{
public:
	struct FText                                       Text;                                                     // 0x0128(0x0018) (Edit)
	struct FScriptDelegate                             TextDelegate;                                             // 0x0140(0x0014) (ZeroConstructor, InstancedReference)
	struct FSlateCore_SlateColor                       ColorAndOpacity;                                          // 0x0150(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FScriptDelegate                             ColorAndOpacityDelegate;                                  // 0x0178(0x0014) (ZeroConstructor, InstancedReference)
	struct FSlateCore_SlateFontInfo                    Font;                                                     // 0x0188(0x0050) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FSlateCore_SlateBrush                       StrikeBrush;                                              // 0x01D8(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FVector2D                                   ShadowOffset;                                             // 0x0260(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                ShadowColorAndOpacity;                                    // 0x0268(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FScriptDelegate                             ShadowColorAndOpacityDelegate;                            // 0x0278(0x0014) (ZeroConstructor, InstancedReference)
	float                                              MinDesiredWidth;                                          // 0x0288(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bWrapWithInvalidationPanel;                               // 0x028C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bAutoWrapText;                                            // 0x028D(0x0001) (ZeroConstructor, Deprecated, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x028E(0x0002) MISSED OFFSET
	TMap<FUMG_UMG_EUserSettingColor, struct FSlateCore_SlateColor> SettingTextColorMap;                                      // 0x0290(0x0050) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               bSimpleTextMode;                                          // 0x02E0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x17];                                      // 0x02E1(0x0017) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.TextBlock");
		if (!ptr)
			ptr = UObject::FindClass("Class UMG.TextBlock");
		return ptr;
	}


	void SetText(const struct FText& InText);
	void SetStrikeBrush(const struct FSlateCore_SlateBrush& InStrikeBrush);
	void SetShadowOffset(const struct FVector2D& InShadowOffset);
	void SetShadowColorAndOpacity(const struct FLinearColor& InShadowColorAndOpacity);
	void SetOpacity(float InOpacity);
	void SetMinDesiredWidth(float InMinDesiredWidth);
	void SetFont(const struct FSlateCore_SlateFontInfo& InFontInfo);
	void SetColorAndOpacity(const struct FSlateCore_SlateColor& InColorAndOpacity, FUMG_UMG_EUserSettingColor SettingColor);
	void SetAutoWrapText(bool InAutoTextWrap);
	struct FText GetText();
	class UEngine_MaterialInstanceDynamic* GetDynamicOutlineMaterial();
	class UEngine_MaterialInstanceDynamic* GetDynamicFontMaterial();
};


// Class UMG.VerticalBox
// 0x0010 (0x0130 - 0x0120)
class UUMG_VerticalBox : public UUMG_PanelWidget
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0120(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.VerticalBox");
		if (!ptr)
			ptr = UObject::FindClass("Class UMG.VerticalBox");
		return ptr;
	}


	class UUMG_VerticalBoxSlot* AddChildToVerticalBox(class UUMG_Widget* Content);
};


// Class UMG.UserWidget
// 0x0128 (0x0230 - 0x0108)
class UUMG_UserWidget : public UUMG_Widget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0108(0x0008) MISSED OFFSET
	struct FLinearColor                                ColorAndOpacity;                                          // 0x0110(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FScriptDelegate                             ColorAndOpacityDelegate;                                  // 0x0120(0x0014) (ZeroConstructor, InstancedReference)
	struct FSlateCore_SlateColor                       ForegroundColor;                                          // 0x0130(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FScriptDelegate                             ForegroundColorDelegate;                                  // 0x0158(0x0014) (ZeroConstructor, InstancedReference)
	struct FSlateCore_Margin                           Padding;                                                  // 0x0168(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TArray<class UUMG_UMGSequencePlayer*>              ActiveSequencePlayers;                                    // 0x0178(0x0010) (ZeroConstructor, Transient)
	TArray<class UUMG_UMGSequencePlayer*>              StoppedSequencePlayers;                                   // 0x0188(0x0010) (ZeroConstructor, Transient)
	TArray<struct FUMG_NamedSlotBinding>               NamedSlotBindings;                                        // 0x0198(0x0010) (ZeroConstructor)
	class UUMG_WidgetTree*                             WidgetTree;                                               // 0x01A8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	int                                                Priority;                                                 // 0x01B0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bSupportsKeyboardFocus : 1;                               // 0x01B4(0x0001) (Deprecated)
	unsigned char                                      bIsFocusable : 1;                                         // 0x01B4(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bStopAction : 1;                                          // 0x01B4(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bHasScriptImplementedTick : 1;                            // 0x01B4(0x0001)
	unsigned char                                      bHasScriptImplementedPaint : 1;                           // 0x01B4(0x0001)
	unsigned char                                      UnknownData01 : 2;                                        // 0x01B4(0x0001)
	unsigned char                                      bCookedWidgetTree : 1;                                    // 0x01B4(0x0001)
	unsigned char                                      UnknownData02[0xB];                                       // 0x01B5(0x000B) MISSED OFFSET
	FUMG_UMG_EWidgetTickFrequency                      TickFrequency;                                            // 0x01C0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x7];                                       // 0x01C1(0x0007) MISSED OFFSET
	class UEngine_InputComponent*                      InputComponent;                                           // 0x01C8(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, IsPlainOldData)
	TArray<struct FUMG_AnimationEventBinding>          AnimationCallbacks;                                       // 0x01D0(0x0010) (ZeroConstructor, Transient, DuplicateTransient)
	unsigned char                                      UnknownData04[0x50];                                      // 0x01E0(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.UserWidget");
		if (!ptr)
			ptr = UObject::FindClass("Class UMG.UserWidget");
		return ptr;
	}


	void UnregisterInputComponent();
	void UnbindFromAnimationStarted(class UUMG_WidgetAnimation* Animation, const struct FScriptDelegate& Delegate);
	void UnbindFromAnimationFinished(class UUMG_WidgetAnimation* Animation, const struct FScriptDelegate& Delegate);
	void UnbindAllFromAnimationStarted(class UUMG_WidgetAnimation* Animation);
	void UnbindAllFromAnimationFinished(class UUMG_WidgetAnimation* Animation);
	void Tick(const struct FSlateCore_Geometry& MyGeometry, float InDeltaTime);
	void StopListeningForInputAction(const struct FName& ActionName, TEnumAsByte<FEngine_Engine_EInputEvent> EventType);
	void StopListeningForAllInputActions();
	void StopAnimationsAndLatentActions();
	void StopAnimation(class UUMG_WidgetAnimation* InAnimation);
	void StopAllAnimations();
	void SetPositionInViewport(const struct FVector2D& Position, bool bRemoveDPIScale);
	void SetPlaybackSpeed(class UUMG_WidgetAnimation* InAnimation, float PlaybackSpeed);
	void SetPadding(const struct FSlateCore_Margin& InPadding);
	void SetOwningPlayer(class AEngine_PlayerController* LocalPlayerController);
	void SetNumLoopsToPlay(class UUMG_WidgetAnimation* InAnimation, int NumLoopsToPlay);
	void SetInputActionPriority(int NewPriority);
	void SetInputActionBlocking(bool bShouldBlock);
	void SetForegroundColor(const struct FSlateCore_SlateColor& InForegroundColor);
	void SetDesiredSizeInViewport(const struct FVector2D& Size);
	void SetColorAndOpacity(const struct FLinearColor& InColorAndOpacity);
	void SetAnchorsInViewport(const struct FSlate_Anchors& Anchors);
	void SetAlignmentInViewport(const struct FVector2D& Alignment);
	void ReverseAnimation(class UUMG_WidgetAnimation* InAnimation);
	void RemoveFromViewport();
	void RegisterInputComponent();
	void PreConstruct(bool IsDesignTime);
	void PlaySound(class UEngine_SoundBase* SoundToPlay);
	class UUMG_UMGSequencePlayer* PlayAnimationTimeRange(class UUMG_WidgetAnimation* InAnimation, float StartAtTime, float EndAtTime, int NumLoopsToPlay, TEnumAsByte<FUMG_UMG_EUMGSequencePlayMode> PlayMode, float PlaybackSpeed, bool bRestoreState);
	class UUMG_UMGSequencePlayer* PlayAnimationReverse(class UUMG_WidgetAnimation* InAnimation, float PlaybackSpeed, bool bRestoreState);
	class UUMG_UMGSequencePlayer* PlayAnimationForward(class UUMG_WidgetAnimation* InAnimation, float PlaybackSpeed, bool bRestoreState);
	class UUMG_UMGSequencePlayer* PlayAnimation(class UUMG_WidgetAnimation* InAnimation, float StartAtTime, int NumLoopsToPlay, TEnumAsByte<FUMG_UMG_EUMGSequencePlayMode> PlayMode, float PlaybackSpeed, bool bRestoreState);
	float PauseAnimation(class UUMG_WidgetAnimation* InAnimation);
	struct FUMG_EventReply OnTouchStarted(const struct FSlateCore_Geometry& MyGeometry, const struct FSlateCore_PointerEvent& InTouchEvent);
	struct FUMG_EventReply OnTouchMoved(const struct FSlateCore_Geometry& MyGeometry, const struct FSlateCore_PointerEvent& InTouchEvent);
	struct FUMG_EventReply OnTouchGesture(const struct FSlateCore_Geometry& MyGeometry, const struct FSlateCore_PointerEvent& GestureEvent);
	struct FUMG_EventReply OnTouchForceChanged(const struct FSlateCore_Geometry& MyGeometry, const struct FSlateCore_PointerEvent& InTouchEvent);
	struct FUMG_EventReply OnTouchEnded(const struct FSlateCore_Geometry& MyGeometry, const struct FSlateCore_PointerEvent& InTouchEvent);
	void OnRemovedFromFocusPath(const struct FSlateCore_FocusEvent& InFocusEvent);
	struct FUMG_EventReply OnPreviewMouseButtonDown(const struct FSlateCore_Geometry& MyGeometry, const struct FSlateCore_PointerEvent& MouseEvent);
	struct FUMG_EventReply OnPreviewKeyDown(const struct FSlateCore_Geometry& MyGeometry, const struct FSlateCore_KeyEvent& InKeyEvent);
	void OnPaint(struct FUMG_PaintContext* Context);
	struct FUMG_EventReply OnMouseWheel(const struct FSlateCore_Geometry& MyGeometry, const struct FSlateCore_PointerEvent& MouseEvent);
	struct FUMG_EventReply OnMouseMove(const struct FSlateCore_Geometry& MyGeometry, const struct FSlateCore_PointerEvent& MouseEvent);
	void OnMouseLeave(const struct FSlateCore_PointerEvent& MouseEvent);
	void OnMouseEnter(const struct FSlateCore_Geometry& MyGeometry, const struct FSlateCore_PointerEvent& MouseEvent);
	void OnMouseCaptureLost();
	struct FUMG_EventReply OnMouseButtonUp(const struct FSlateCore_Geometry& MyGeometry, const struct FSlateCore_PointerEvent& MouseEvent);
	struct FUMG_EventReply OnMouseButtonDown(const struct FSlateCore_Geometry& MyGeometry, const struct FSlateCore_PointerEvent& MouseEvent);
	struct FUMG_EventReply OnMouseButtonDoubleClick(const struct FSlateCore_Geometry& InMyGeometry, const struct FSlateCore_PointerEvent& InMouseEvent);
	struct FUMG_EventReply OnMotionDetected(const struct FSlateCore_Geometry& MyGeometry, const struct FSlateCore_MotionEvent& InMotionEvent);
	struct FUMG_EventReply OnKeyUp(const struct FSlateCore_Geometry& MyGeometry, const struct FSlateCore_KeyEvent& InKeyEvent);
	struct FUMG_EventReply OnKeyDown(const struct FSlateCore_Geometry& MyGeometry, const struct FSlateCore_KeyEvent& InKeyEvent);
	struct FUMG_EventReply OnKeyChar(const struct FSlateCore_Geometry& MyGeometry, const struct FSlateCore_CharacterEvent& InCharacterEvent);
	void OnInitialized();
	struct FUMG_EventReply OnFocusReceived(const struct FSlateCore_Geometry& MyGeometry, const struct FSlateCore_FocusEvent& InFocusEvent);
	void OnFocusLost(const struct FSlateCore_FocusEvent& InFocusEvent);
	bool OnDrop(const struct FSlateCore_Geometry& MyGeometry, const struct FSlateCore_PointerEvent& PointerEvent, class UUMG_DragDropOperation* Operation);
	bool OnDragOver(const struct FSlateCore_Geometry& MyGeometry, const struct FSlateCore_PointerEvent& PointerEvent, class UUMG_DragDropOperation* Operation);
	void OnDragLeave(const struct FSlateCore_PointerEvent& PointerEvent, class UUMG_DragDropOperation* Operation);
	void OnDragEnter(const struct FSlateCore_Geometry& MyGeometry, const struct FSlateCore_PointerEvent& PointerEvent, class UUMG_DragDropOperation* Operation);
	void OnDragDetected(const struct FSlateCore_Geometry& MyGeometry, const struct FSlateCore_PointerEvent& PointerEvent, class UUMG_DragDropOperation** Operation);
	void OnDragCancelled(const struct FSlateCore_PointerEvent& PointerEvent, class UUMG_DragDropOperation* Operation);
	void OnAnimationStarted(class UUMG_WidgetAnimation* Animation);
	void OnAnimationFinished(class UUMG_WidgetAnimation* Animation);
	struct FUMG_EventReply OnAnalogValueChanged(const struct FSlateCore_Geometry& MyGeometry, const struct FSlateCore_AnalogInputEvent& InAnalogInputEvent);
	void OnAddedToFocusPath(const struct FSlateCore_FocusEvent& InFocusEvent);
	void ListenForInputAction(const struct FName& ActionName, TEnumAsByte<FEngine_Engine_EInputEvent> EventType, bool bConsume, const struct FScriptDelegate& Callback);
	bool IsPlayingAnimation();
	bool IsListeningForInputAction(const struct FName& ActionName);
	bool IsInViewport();
	bool IsInteractable();
	bool IsAnyAnimationPlaying();
	bool IsAnimationPlayingForward(class UUMG_WidgetAnimation* InAnimation);
	bool IsAnimationPlaying(class UUMG_WidgetAnimation* InAnimation);
	class AEngine_Pawn* GetOwningPlayerPawn();
	bool GetIsVisible();
	float GetAnimationCurrentTime(class UUMG_WidgetAnimation* InAnimation);
	struct FSlate_Anchors GetAnchorsInViewport();
	struct FVector2D GetAlignmentInViewport();
	void Destruct();
	void Construct();
	void CancelLatentActions();
	void BindToAnimationStarted(class UUMG_WidgetAnimation* Animation, const struct FScriptDelegate& Delegate);
	void BindToAnimationFinished(class UUMG_WidgetAnimation* Animation, const struct FScriptDelegate& Delegate);
	void BindToAnimationEvent(class UUMG_WidgetAnimation* Animation, const struct FScriptDelegate& Delegate, FUMG_UMG_EWidgetAnimationEvent AnimationEvent, const struct FName& UserTag);
	void AddToViewport(int ZOrder);
	bool AddToPlayerScreen(int ZOrder);
};


// Class UMG.WidgetLayoutLibrary
// 0x0000 (0x0028 - 0x0028)
class UUMG_WidgetLayoutLibrary : public UEngine_BlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UMG.WidgetLayoutLibrary");
		if (!ptr)
			ptr = UObject::FindClass("Class UMG.WidgetLayoutLibrary");
		return ptr;
	}


	class UUMG_WrapBoxSlot* STATIC_SlotAsWrapBoxSlot(class UUMG_Widget* Widget);
	class UUMG_WidgetSwitcherSlot* STATIC_SlotAsWidgetSwitcherSlot(class UUMG_Widget* Widget);
	class UUMG_VerticalBoxSlot* STATIC_SlotAsVerticalBoxSlot(class UUMG_Widget* Widget);
	class UUMG_UniformGridSlot* STATIC_SlotAsUniformGridSlot(class UUMG_Widget* Widget);
	class UUMG_SizeBoxSlot* STATIC_SlotAsSizeBoxSlot(class UUMG_Widget* Widget);
	class UUMG_ScrollBoxSlot* STATIC_SlotAsScrollBoxSlot(class UUMG_Widget* Widget);
	class UUMG_ScaleBoxSlot* STATIC_SlotAsScaleBoxSlot(class UUMG_Widget* Widget);
	class UUMG_SafeZoneSlot* STATIC_SlotAsSafeBoxSlot(class UUMG_Widget* Widget);
	class UUMG_OverlaySlot* STATIC_SlotAsOverlaySlot(class UUMG_Widget* Widget);
	class UUMG_HorizontalBoxSlot* STATIC_SlotAsHorizontalBoxSlot(class UUMG_Widget* Widget);
	class UUMG_GridSlot* STATIC_SlotAsGridSlot(class UUMG_Widget* Widget);
	class UUMG_CanvasPanelSlot* STATIC_SlotAsCanvasSlot(class UUMG_Widget* Widget);
	class UUMG_BorderSlot* STATIC_SlotAsBorderSlot(class UUMG_Widget* Widget);
	void STATIC_RemoveAllWidgets(class UObject* WorldContextObject);
	bool STATIC_ProjectWorldLocationToWidgetPosition(class AEngine_PlayerController* PlayerController, const struct FVector& WorldLocation, struct FVector2D* ScreenPosition);
	struct FSlateCore_Geometry STATIC_GetViewportWidgetGeometry(class UObject* WorldContextObject);
	struct FVector2D STATIC_GetViewportSize(class UObject* WorldContextObject);
	float STATIC_GetViewportScale(class UObject* WorldContextObject);
	struct FSlateCore_Geometry STATIC_GetPlayerScreenWidgetGeometry(class AEngine_PlayerController* PlayerController);
	bool STATIC_GetMousePositionScaledByDPI(class AEngine_PlayerController* Player, float* LocationX, float* LocationY);
	struct FVector2D STATIC_GetMousePositionOnViewport(class UObject* WorldContextObject);
	struct FVector2D STATIC_GetMousePositionOnPlatform();
};


// Class UMG.AsyncTaskDownloadImage
// 0x0020 (0x0050 - 0x0030)
class UUMG_AsyncTaskDownloadImage : public UEngine_BlueprintAsyncActionBase
{
public:
	struct FScriptMulticastDelegate                    OnSuccess;                                                // 0x0030(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnFail;                                                   // 0x0040(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)

	static UClass* StaticClass()
	{
